/* automatically generated by rust-bindgen 0.71.1 */

pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 1;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _CRT_FUNCTIONS_REQUIRED: u32 = 1;
pub const _CRT_HAS_CXX17: u32 = 0;
pub const _CRT_HAS_C11: u32 = 1;
pub const _CRT_INTERNAL_NONSTDC_NAMES: u32 = 1;
pub const __STDC_SECURE_LIB__: u32 = 200411;
pub const __GOT_SECURE_LIB__: u32 = 200411;
pub const __STDC_WANT_SECURE_LIB__: u32 = 1;
pub const _SECURECRT_FILL_BUFFER_PATTERN: u32 = 254;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_COUNT: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES: u32 = 1;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_MEMORY: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES_MEMORY: u32 = 0;
pub const _CRT_INTERNAL_STDIO_SYMBOL_PREFIX: &[u8; 1] = b"\0";
pub const _CRT_INTERNAL_PRINTF_LEGACY_VSPRINTF_NULL_TERMINATION: u32 = 1;

pub const FPE_STACKUNDERFLOW: u32 = 139;
pub const FPE_EXPLICITGEN: u32 = 140;
pub const __64BIT__: u32 = 1;
pub const TA_INTEGER_MIN: i32 = -2147483647;
pub const TA_INTEGER_MAX: u32 = 2147483647;
pub const TA_REAL_MIN: f64 = -30000000000000000000000000000000000000.0;
pub const TA_REAL_MAX: f64 = 30000000000000000000000000000000000000.0;
pub const TA_INTEGER_DEFAULT: i32 = -2147483648;
pub const TA_REAL_DEFAULT: f64 = -40000000000000000000000000000000000000.0;
pub const TA_FUNC_FLG_OVERLAP: u32 = 16777216;
pub const TA_FUNC_FLG_VOLUME: u32 = 67108864;
pub const TA_FUNC_FLG_UNST_PER: u32 = 134217728;
pub const TA_FUNC_FLG_CANDLESTICK: u32 = 268435456;
pub const TA_IN_PRICE_OPEN: u32 = 1;
pub const TA_IN_PRICE_HIGH: u32 = 2;
pub const TA_IN_PRICE_LOW: u32 = 4;
pub const TA_IN_PRICE_CLOSE: u32 = 8;
pub const TA_IN_PRICE_VOLUME: u32 = 16;
pub const TA_IN_PRICE_OPENINTEREST: u32 = 32;
pub const TA_IN_PRICE_TIMESTAMP: u32 = 64;
pub const TA_OPTIN_IS_PERCENT: u32 = 1048576;
pub const TA_OPTIN_IS_DEGREE: u32 = 2097152;
pub const TA_OPTIN_IS_CURRENCY: u32 = 4194304;
pub const TA_OPTIN_ADVANCED: u32 = 16777216;
pub const TA_OUT_LINE: u32 = 1;
pub const TA_OUT_DOT_LINE: u32 = 2;
pub const TA_OUT_DASH_LINE: u32 = 4;
pub const TA_OUT_DOT: u32 = 8;
pub const TA_OUT_HISTO: u32 = 16;
pub const TA_OUT_PATTERN_BOOL: u32 = 32;
pub const TA_OUT_PATTERN_BULL_BEAR: u32 = 64;
pub const TA_OUT_PATTERN_STRENGTH: u32 = 128;
pub const TA_OUT_POSITIVE: u32 = 256;
pub const TA_OUT_NEGATIVE: u32 = 512;
pub const TA_OUT_ZERO: u32 = 1024;
pub const TA_OUT_UPPER_LIMIT: u32 = 2048;
pub const TA_OUT_LOWER_LIMIT: u32 = 4096;
pub type va_list = *mut ::core::ffi::c_char;
unsafe extern "C" {
    pub fn __va_start(arg1: *mut *mut ::core::ffi::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::core::ffi::c_ushort;
unsafe extern "C" {
    pub fn __security_init_cookie();
}
unsafe extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
unsafe extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
unsafe extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
unsafe extern "C" {
    pub fn _invalid_parameter_noinfo();
}
unsafe extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
unsafe extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::core::ffi::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::core::ffi::c_int;
pub type wint_t = ::core::ffi::c_ushort;
pub type wctype_t = ::core::ffi::c_ushort;
pub type __time32_t = ::core::ffi::c_long;
pub type __time64_t = ::core::ffi::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::core::ffi::c_ushort,
    pub _locale_mb_cur_max: ::core::ffi::c_int,
    pub _locale_lc_codepage: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_data_public"]
        [::core::mem::size_of::<__crt_locale_data_public>() - 16usize];
    ["Alignment of __crt_locale_data_public"]
        [::core::mem::align_of::<__crt_locale_data_public>() - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_pctype"]
        [::core::mem::offset_of!(__crt_locale_data_public, _locale_pctype) - 0usize];
    ["Offset of field: __crt_locale_data_public::_locale_mb_cur_max"]
        [::core::mem::offset_of!(__crt_locale_data_public, _locale_mb_cur_max) - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_lc_codepage"]
        [::core::mem::offset_of!(__crt_locale_data_public, _locale_lc_codepage) - 12usize];
};
impl Default for __crt_locale_data_public {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_pointers"][::core::mem::size_of::<__crt_locale_pointers>() - 16usize];
    ["Alignment of __crt_locale_pointers"]
        [::core::mem::align_of::<__crt_locale_pointers>() - 8usize];
    ["Offset of field: __crt_locale_pointers::locinfo"]
        [::core::mem::offset_of!(__crt_locale_pointers, locinfo) - 0usize];
    ["Offset of field: __crt_locale_pointers::mbcinfo"]
        [::core::mem::offset_of!(__crt_locale_pointers, mbcinfo) - 8usize];
};
impl Default for __crt_locale_pointers {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::core::ffi::c_ulong,
    pub _Byte: ::core::ffi::c_ushort,
    pub _State: ::core::ffi::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Mbstatet"][::core::mem::size_of::<_Mbstatet>() - 8usize];
    ["Alignment of _Mbstatet"][::core::mem::align_of::<_Mbstatet>() - 4usize];
    ["Offset of field: _Mbstatet::_Wchar"][::core::mem::offset_of!(_Mbstatet, _Wchar) - 0usize];
    ["Offset of field: _Mbstatet::_Byte"][::core::mem::offset_of!(_Mbstatet, _Byte) - 4usize];
    ["Offset of field: _Mbstatet::_State"][::core::mem::offset_of!(_Mbstatet, _State) - 6usize];
};
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _iobuf {
    pub _Placeholder: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _iobuf"][::core::mem::size_of::<_iobuf>() - 8usize];
    ["Alignment of _iobuf"][::core::mem::align_of::<_iobuf>() - 8usize];
    ["Offset of field: _iobuf::_Placeholder"]
        [::core::mem::offset_of!(_iobuf, _Placeholder) - 0usize];
};
impl Default for _iobuf {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type FILE = _iobuf;
unsafe extern "C" {
    pub fn __acrt_iob_func(_Ix: ::core::ffi::c_uint) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fgetwc(_Stream: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn _fgetwchar() -> wint_t;
}
unsafe extern "C" {
    pub fn fputwc(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn _fputwchar(_Character: wchar_t) -> wint_t;
}
unsafe extern "C" {
    pub fn getwc(_Stream: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn getwchar() -> wint_t;
}
unsafe extern "C" {
    pub fn fgetws(
        _Buffer: *mut wchar_t,
        _BufferCount: ::core::ffi::c_int,
        _Stream: *mut FILE,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn fputws(_Buffer: *const wchar_t, _Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _getws_s(_Buffer: *mut wchar_t, _BufferCount: usize) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn putwc(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn putwchar(_Character: wchar_t) -> wint_t;
}
unsafe extern "C" {
    pub fn _putws(_Buffer: *const wchar_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ungetwc(_Character: wint_t, _Stream: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn _wfdopen(_FileHandle: ::core::ffi::c_int, _Mode: *const wchar_t) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _wfopen(_FileName: *const wchar_t, _Mode: *const wchar_t) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _wfopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wfreopen(
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _OldStream: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _wfreopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _OldStream: *mut FILE,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wfsopen(
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _ShFlag: ::core::ffi::c_int,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _wperror(_ErrorMessage: *const wchar_t);
}
unsafe extern "C" {
    pub fn _wpopen(_Command: *const wchar_t, _Mode: *const wchar_t) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _wremove(_FileName: *const wchar_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _wtempnam(_Directory: *const wchar_t, _FilePrefix: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wtmpnam_s(_Buffer: *mut wchar_t, _BufferCount: usize) -> errno_t;
}
unsafe extern "C" {
    pub fn _wtmpnam(_Buffer: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _fgetwc_nolock(_Stream: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn _fputwc_nolock(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn _getwc_nolock(_Stream: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn _putwc_nolock(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn _ungetwc_nolock(_Character: wint_t, _Stream: *mut FILE) -> wint_t;
}
unsafe extern "C" {
    pub fn __stdio_common_vfwprintf(
        _Options: ::core::ffi::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vfwprintf_s(
        _Options: ::core::ffi::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vfwprintf_p(
        _Options: ::core::ffi::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vfwscanf(
        _Options: ::core::ffi::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vswprintf(
        _Options: ::core::ffi::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vswprintf_s(
        _Options: ::core::ffi::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vsnwprintf_s(
        _Options: ::core::ffi::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _MaxCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vswprintf_p(
        _Options: ::core::ffi::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vswscanf(
        _Options: ::core::ffi::c_ulonglong,
        _Buffer: *const wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
pub type fpos_t = ::core::ffi::c_longlong;
unsafe extern "C" {
    pub fn _get_stream_buffer_pointers(
        _Stream: *mut FILE,
        _Base: *mut *mut *mut ::core::ffi::c_char,
        _Pointer: *mut *mut *mut ::core::ffi::c_char,
        _Count: *mut *mut ::core::ffi::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn clearerr_s(_Stream: *mut FILE) -> errno_t;
}
unsafe extern "C" {
    pub fn fopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const ::core::ffi::c_char,
        _Mode: *const ::core::ffi::c_char,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn fread_s(
        _Buffer: *mut ::core::ffi::c_void,
        _BufferSize: usize,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn freopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const ::core::ffi::c_char,
        _Mode: *const ::core::ffi::c_char,
        _OldStream: *mut FILE,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn gets_s(_Buffer: *mut ::core::ffi::c_char, _Size: rsize_t) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn tmpfile_s(_Stream: *mut *mut FILE) -> errno_t;
}
unsafe extern "C" {
    pub fn tmpnam_s(_Buffer: *mut ::core::ffi::c_char, _Size: rsize_t) -> errno_t;
}
unsafe extern "C" {
    pub fn clearerr(_Stream: *mut FILE);
}
unsafe extern "C" {
    pub fn fclose(_Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _fcloseall() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _fdopen(_FileHandle: ::core::ffi::c_int, _Mode: *const ::core::ffi::c_char)
        -> *mut FILE;
}
unsafe extern "C" {
    pub fn feof(_Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ferror(_Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fflush(_Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fgetc(_Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _fgetchar() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fgetpos(_Stream: *mut FILE, _Position: *mut fpos_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fgets(
        _Buffer: *mut ::core::ffi::c_char,
        _MaxCount: ::core::ffi::c_int,
        _Stream: *mut FILE,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _fileno(_Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _flushall() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fopen(
        _FileName: *const ::core::ffi::c_char,
        _Mode: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fputc(_Character: ::core::ffi::c_int, _Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _fputchar(_Character: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fputs(_Buffer: *const ::core::ffi::c_char, _Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fread(
        _Buffer: *mut ::core::ffi::c_void,
        _ElementSize: ::core::ffi::c_ulonglong,
        _ElementCount: ::core::ffi::c_ulonglong,
        _Stream: *mut FILE,
    ) -> ::core::ffi::c_ulonglong;
}
unsafe extern "C" {
    pub fn freopen(
        _FileName: *const ::core::ffi::c_char,
        _Mode: *const ::core::ffi::c_char,
        _Stream: *mut FILE,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn _fsopen(
        _FileName: *const ::core::ffi::c_char,
        _Mode: *const ::core::ffi::c_char,
        _ShFlag: ::core::ffi::c_int,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fsetpos(_Stream: *mut FILE, _Position: *const fpos_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fseek(
        _Stream: *mut FILE,
        _Offset: ::core::ffi::c_long,
        _Origin: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _fseeki64(
        _Stream: *mut FILE,
        _Offset: ::core::ffi::c_longlong,
        _Origin: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ftell(_Stream: *mut FILE) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn _ftelli64(_Stream: *mut FILE) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn fwrite(
        _Buffer: *const ::core::ffi::c_void,
        _ElementSize: ::core::ffi::c_ulonglong,
        _ElementCount: ::core::ffi::c_ulonglong,
        _Stream: *mut FILE,
    ) -> ::core::ffi::c_ulonglong;
}
unsafe extern "C" {
    pub fn getc(_Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _getmaxstdio() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _getw(_Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn perror(_ErrorMessage: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn _pclose(_Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _popen(
        _Command: *const ::core::ffi::c_char,
        _Mode: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn putc(_Character: ::core::ffi::c_int, _Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn putchar(_Character: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn puts(_Buffer: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _putw(_Word: ::core::ffi::c_int, _Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn remove(_FileName: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn rename(
        _OldFileName: *const ::core::ffi::c_char,
        _NewFileName: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _unlink(_FileName: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn unlink(_FileName: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn rewind(_Stream: *mut FILE);
}
unsafe extern "C" {
    pub fn _rmtmp() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setbuf(_Stream: *mut FILE, _Buffer: *mut ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn _setmaxstdio(_Maximum: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setvbuf(
        _Stream: *mut FILE,
        _Buffer: *mut ::core::ffi::c_char,
        _Mode: ::core::ffi::c_int,
        _Size: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _tempnam(
        _DirectoryName: *const ::core::ffi::c_char,
        _FilePrefix: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(_Buffer: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ungetc(_Character: ::core::ffi::c_int, _Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _lock_file(_Stream: *mut FILE);
}
unsafe extern "C" {
    pub fn _unlock_file(_Stream: *mut FILE);
}
unsafe extern "C" {
    pub fn _fclose_nolock(_Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _fflush_nolock(_Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _fgetc_nolock(_Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _fputc_nolock(_Character: ::core::ffi::c_int, _Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _fread_nolock(
        _Buffer: *mut ::core::ffi::c_void,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _fread_nolock_s(
        _Buffer: *mut ::core::ffi::c_void,
        _BufferSize: usize,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _fseek_nolock(
        _Stream: *mut FILE,
        _Offset: ::core::ffi::c_long,
        _Origin: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _fseeki64_nolock(
        _Stream: *mut FILE,
        _Offset: ::core::ffi::c_longlong,
        _Origin: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _ftell_nolock(_Stream: *mut FILE) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn _ftelli64_nolock(_Stream: *mut FILE) -> ::core::ffi::c_longlong;
}
unsafe extern "C" {
    pub fn _fwrite_nolock(
        _Buffer: *const ::core::ffi::c_void,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _getc_nolock(_Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _putc_nolock(_Character: ::core::ffi::c_int, _Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _ungetc_nolock(_Character: ::core::ffi::c_int, _Stream: *mut FILE)
        -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __p__commode() -> *mut ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vfprintf(
        _Options: ::core::ffi::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::core::ffi::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vfprintf_s(
        _Options: ::core::ffi::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::core::ffi::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vfprintf_p(
        _Options: ::core::ffi::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::core::ffi::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _set_printf_count_output(_Value: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _get_printf_count_output() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vfscanf(
        _Options: ::core::ffi::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::core::ffi::c_char,
        _Locale: _locale_t,
        _Arglist: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vsprintf(
        _Options: ::core::ffi::c_ulonglong,
        _Buffer: *mut ::core::ffi::c_char,
        _BufferCount: usize,
        _Format: *const ::core::ffi::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vsprintf_s(
        _Options: ::core::ffi::c_ulonglong,
        _Buffer: *mut ::core::ffi::c_char,
        _BufferCount: usize,
        _Format: *const ::core::ffi::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vsnprintf_s(
        _Options: ::core::ffi::c_ulonglong,
        _Buffer: *mut ::core::ffi::c_char,
        _BufferCount: usize,
        _MaxCount: usize,
        _Format: *const ::core::ffi::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vsprintf_p(
        _Options: ::core::ffi::c_ulonglong,
        _Buffer: *mut ::core::ffi::c_char,
        _BufferCount: usize,
        _Format: *const ::core::ffi::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __stdio_common_vsscanf(
        _Options: ::core::ffi::c_ulonglong,
        _Buffer: *const ::core::ffi::c_char,
        _BufferCount: usize,
        _Format: *const ::core::ffi::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn tempnam(
        _Directory: *const ::core::ffi::c_char,
        _FilePrefix: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fcloseall() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fdopen(
        _FileHandle: ::core::ffi::c_int,
        _Format: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fgetchar() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fileno(_Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn flushall() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fputchar(_Ch: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getw(_Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn putw(_Ch: ::core::ffi::c_int, _Stream: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn rmtmp() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _clearfp() -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn _controlfp(
        _NewValue: ::core::ffi::c_uint,
        _Mask: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn _set_controlfp(_NewValue: ::core::ffi::c_uint, _Mask: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn _controlfp_s(
        _CurrentState: *mut ::core::ffi::c_uint,
        _NewValue: ::core::ffi::c_uint,
        _Mask: ::core::ffi::c_uint,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _statusfp() -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn _fpreset();
}
unsafe extern "C" {
    pub fn _control87(
        _NewValue: ::core::ffi::c_uint,
        _Mask: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn __fpecode() -> *mut ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __fpe_flt_rounds() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _copysign(_Number: f64, _Sign: f64) -> f64;
}
unsafe extern "C" {
    pub fn _chgsign(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn _scalb(_X: f64, _Y: ::core::ffi::c_long) -> f64;
}
unsafe extern "C" {
    pub fn _logb(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn _nextafter(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn _finite(_X: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _isnan(_X: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _fpclass(_X: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _scalbf(_X: f32, _Y: ::core::ffi::c_long) -> f32;
}
unsafe extern "C" {
    pub fn fpreset();
}
pub type Int32 = ::core::ffi::c_int;
pub type UInt32 = ::core::ffi::c_uint;
pub type Int64 = ::core::ffi::c_longlong;
pub type UInt64 = ::core::ffi::c_ulonglong;
pub const TA_RetCode_TA_SUCCESS: TA_RetCode = 0;
pub const TA_RetCode_TA_LIB_NOT_INITIALIZE: TA_RetCode = 1;
pub const TA_RetCode_TA_BAD_PARAM: TA_RetCode = 2;
pub const TA_RetCode_TA_ALLOC_ERR: TA_RetCode = 3;
pub const TA_RetCode_TA_GROUP_NOT_FOUND: TA_RetCode = 4;
pub const TA_RetCode_TA_FUNC_NOT_FOUND: TA_RetCode = 5;
pub const TA_RetCode_TA_INVALID_HANDLE: TA_RetCode = 6;
pub const TA_RetCode_TA_INVALID_PARAM_HOLDER: TA_RetCode = 7;
pub const TA_RetCode_TA_INVALID_PARAM_HOLDER_TYPE: TA_RetCode = 8;
pub const TA_RetCode_TA_INVALID_PARAM_FUNCTION: TA_RetCode = 9;
pub const TA_RetCode_TA_INPUT_NOT_ALL_INITIALIZE: TA_RetCode = 10;
pub const TA_RetCode_TA_OUTPUT_NOT_ALL_INITIALIZE: TA_RetCode = 11;
pub const TA_RetCode_TA_OUT_OF_RANGE_START_INDEX: TA_RetCode = 12;
pub const TA_RetCode_TA_OUT_OF_RANGE_END_INDEX: TA_RetCode = 13;
pub const TA_RetCode_TA_INVALID_LIST_TYPE: TA_RetCode = 14;
pub const TA_RetCode_TA_BAD_OBJECT: TA_RetCode = 15;
pub const TA_RetCode_TA_NOT_SUPPORTED: TA_RetCode = 16;
pub const TA_RetCode_TA_INTERNAL_ERROR: TA_RetCode = 5000;
pub const TA_RetCode_TA_UNKNOWN_ERR: TA_RetCode = 65535;
pub type TA_RetCode = ::core::ffi::c_int;
pub const TA_Compatibility_TA_COMPATIBILITY_DEFAULT: TA_Compatibility = 0;
pub const TA_Compatibility_TA_COMPATIBILITY_METASTOCK: TA_Compatibility = 1;
pub type TA_Compatibility = ::core::ffi::c_int;
pub const TA_MAType_TA_MAType_SMA: TA_MAType = 0;
pub const TA_MAType_TA_MAType_EMA: TA_MAType = 1;
pub const TA_MAType_TA_MAType_WMA: TA_MAType = 2;
pub const TA_MAType_TA_MAType_DEMA: TA_MAType = 3;
pub const TA_MAType_TA_MAType_TEMA: TA_MAType = 4;
pub const TA_MAType_TA_MAType_TRIMA: TA_MAType = 5;
pub const TA_MAType_TA_MAType_KAMA: TA_MAType = 6;
pub const TA_MAType_TA_MAType_MAMA: TA_MAType = 7;
pub const TA_MAType_TA_MAType_T3: TA_MAType = 8;
pub type TA_MAType = ::core::ffi::c_int;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_ADX: TA_FuncUnstId = 0;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_ADXR: TA_FuncUnstId = 1;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_ATR: TA_FuncUnstId = 2;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_CMO: TA_FuncUnstId = 3;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_DX: TA_FuncUnstId = 4;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_EMA: TA_FuncUnstId = 5;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_DCPERIOD: TA_FuncUnstId = 6;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_DCPHASE: TA_FuncUnstId = 7;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_PHASOR: TA_FuncUnstId = 8;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_SINE: TA_FuncUnstId = 9;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_TRENDLINE: TA_FuncUnstId = 10;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_TRENDMODE: TA_FuncUnstId = 11;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_IMI: TA_FuncUnstId = 12;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_KAMA: TA_FuncUnstId = 13;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_MAMA: TA_FuncUnstId = 14;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_MFI: TA_FuncUnstId = 15;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_MINUS_DI: TA_FuncUnstId = 16;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_MINUS_DM: TA_FuncUnstId = 17;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_NATR: TA_FuncUnstId = 18;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_PLUS_DI: TA_FuncUnstId = 19;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_PLUS_DM: TA_FuncUnstId = 20;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_RSI: TA_FuncUnstId = 21;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_STOCHRSI: TA_FuncUnstId = 22;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_T3: TA_FuncUnstId = 23;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_ALL: TA_FuncUnstId = 24;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_FuncUnstId_TA_FUNC_UNST_NONE: TA_FuncUnstId = -1;
#[doc = " START GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub type TA_FuncUnstId = ::core::ffi::c_int;
#[doc = " END GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_RangeType_TA_RangeType_RealBody: TA_RangeType = 0;
#[doc = " END GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_RangeType_TA_RangeType_HighLow: TA_RangeType = 1;
#[doc = " END GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub const TA_RangeType_TA_RangeType_Shadows: TA_RangeType = 2;
#[doc = " END GENCODE SECTION 1 - DO NOT DELETE THIS LINE"]
pub type TA_RangeType = ::core::ffi::c_int;
pub const TA_CandleSettingType_TA_BodyLong: TA_CandleSettingType = 0;
pub const TA_CandleSettingType_TA_BodyVeryLong: TA_CandleSettingType = 1;
pub const TA_CandleSettingType_TA_BodyShort: TA_CandleSettingType = 2;
pub const TA_CandleSettingType_TA_BodyDoji: TA_CandleSettingType = 3;
pub const TA_CandleSettingType_TA_ShadowLong: TA_CandleSettingType = 4;
pub const TA_CandleSettingType_TA_ShadowVeryLong: TA_CandleSettingType = 5;
pub const TA_CandleSettingType_TA_ShadowShort: TA_CandleSettingType = 6;
pub const TA_CandleSettingType_TA_ShadowVeryShort: TA_CandleSettingType = 7;
pub const TA_CandleSettingType_TA_Near: TA_CandleSettingType = 8;
pub const TA_CandleSettingType_TA_Far: TA_CandleSettingType = 9;
pub const TA_CandleSettingType_TA_Equal: TA_CandleSettingType = 10;
pub const TA_CandleSettingType_TA_AllCandleSettings: TA_CandleSettingType = 11;
pub type TA_CandleSettingType = ::core::ffi::c_int;
unsafe extern "C" {
    pub fn TA_GetVersionString() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TA_GetVersionMajor() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TA_GetVersionMinor() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TA_GetVersionPatch() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TA_GetVersionDate() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TA_GetVersionTime() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TA_GetVersionBuild() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TA_GetVersionExtra() -> *const ::core::ffi::c_char;
}
pub type TA_Real = f64;
pub type TA_Integer = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_StringTable {
    pub size: ::core::ffi::c_uint,
    pub string: *mut *const ::core::ffi::c_char,
    pub hiddenData: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_StringTable"][::core::mem::size_of::<TA_StringTable>() - 24usize];
    ["Alignment of TA_StringTable"][::core::mem::align_of::<TA_StringTable>() - 8usize];
    ["Offset of field: TA_StringTable::size"]
        [::core::mem::offset_of!(TA_StringTable, size) - 0usize];
    ["Offset of field: TA_StringTable::string"]
        [::core::mem::offset_of!(TA_StringTable, string) - 8usize];
    ["Offset of field: TA_StringTable::hiddenData"]
        [::core::mem::offset_of!(TA_StringTable, hiddenData) - 16usize];
};
impl Default for TA_StringTable {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_RetCodeInfo {
    pub enumStr: *const ::core::ffi::c_char,
    pub infoStr: *const ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_RetCodeInfo"][::core::mem::size_of::<TA_RetCodeInfo>() - 16usize];
    ["Alignment of TA_RetCodeInfo"][::core::mem::align_of::<TA_RetCodeInfo>() - 8usize];
    ["Offset of field: TA_RetCodeInfo::enumStr"]
        [::core::mem::offset_of!(TA_RetCodeInfo, enumStr) - 0usize];
    ["Offset of field: TA_RetCodeInfo::infoStr"]
        [::core::mem::offset_of!(TA_RetCodeInfo, infoStr) - 8usize];
};
impl Default for TA_RetCodeInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn TA_SetRetCodeInfo(theRetCode: TA_RetCode, retCodeInfo: *mut TA_RetCodeInfo);
}
unsafe extern "C" {
    pub fn TA_Initialize() -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_Shutdown() -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ACCBANDS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outRealUpperBand: *mut f64,
        outRealMiddleBand: *mut f64,
        outRealLowerBand: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ACCBANDS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outRealUpperBand: *mut f64,
        outRealMiddleBand: *mut f64,
        outRealLowerBand: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ACCBANDS_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ACOS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ACOS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ACOS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_AD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        inVolume: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_AD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        inVolume: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_AD_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ADD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ADD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ADD_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ADOSC(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        inVolume: *const f64,
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ADOSC(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        inVolume: *const f32,
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ADOSC_Lookback(
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ADX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ADX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ADX_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ADXR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ADXR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ADXR_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_APO(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_APO(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_APO_Lookback(
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_AROON(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outAroonDown: *mut f64,
        outAroonUp: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_AROON(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outAroonDown: *mut f64,
        outAroonUp: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_AROON_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_AROONOSC(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_AROONOSC(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_AROONOSC_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ASIN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ASIN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ASIN_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ATAN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ATAN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ATAN_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ATR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ATR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ATR_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_AVGPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_AVGPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_AVGPRICE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_AVGDEV(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_AVGDEV(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_AVGDEV_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_BBANDS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        optInNbDevUp: f64,
        optInNbDevDn: f64,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outRealUpperBand: *mut f64,
        outRealMiddleBand: *mut f64,
        outRealLowerBand: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_BBANDS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        optInNbDevUp: f64,
        optInNbDevDn: f64,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outRealUpperBand: *mut f64,
        outRealMiddleBand: *mut f64,
        outRealLowerBand: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_BBANDS_Lookback(
        optInTimePeriod: ::core::ffi::c_int,
        optInNbDevUp: f64,
        optInNbDevDn: f64,
        optInMAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_BETA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_BETA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_BETA_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_BOP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_BOP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_BOP_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CCI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CCI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CCI_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDL2CROWS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDL2CROWS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDL2CROWS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDL3BLACKCROWS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDL3BLACKCROWS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDL3BLACKCROWS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDL3INSIDE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDL3INSIDE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDL3INSIDE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDL3LINESTRIKE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDL3LINESTRIKE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDL3LINESTRIKE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDL3OUTSIDE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDL3OUTSIDE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDL3OUTSIDE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDL3STARSINSOUTH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDL3STARSINSOUTH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDL3STARSINSOUTH_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDL3WHITESOLDIERS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDL3WHITESOLDIERS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDL3WHITESOLDIERS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLABANDONEDBABY(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLABANDONEDBABY(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLABANDONEDBABY_Lookback(optInPenetration: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLADVANCEBLOCK(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLADVANCEBLOCK(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLADVANCEBLOCK_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLBELTHOLD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLBELTHOLD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLBELTHOLD_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLBREAKAWAY(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLBREAKAWAY(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLBREAKAWAY_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLCLOSINGMARUBOZU(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLCLOSINGMARUBOZU(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLCLOSINGMARUBOZU_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLCONCEALBABYSWALL(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLCONCEALBABYSWALL(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLCONCEALBABYSWALL_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLCOUNTERATTACK(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLCOUNTERATTACK(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLCOUNTERATTACK_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLDARKCLOUDCOVER(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLDARKCLOUDCOVER(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLDARKCLOUDCOVER_Lookback(optInPenetration: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLDOJI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLDOJI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLDOJI_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLDOJISTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLDOJISTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLDOJISTAR_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLDRAGONFLYDOJI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLDRAGONFLYDOJI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLDRAGONFLYDOJI_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLENGULFING(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLENGULFING(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLENGULFING_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLEVENINGDOJISTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLEVENINGDOJISTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLEVENINGDOJISTAR_Lookback(optInPenetration: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLEVENINGSTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLEVENINGSTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLEVENINGSTAR_Lookback(optInPenetration: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLGAPSIDESIDEWHITE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLGAPSIDESIDEWHITE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLGAPSIDESIDEWHITE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLGRAVESTONEDOJI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLGRAVESTONEDOJI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLGRAVESTONEDOJI_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLHAMMER(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLHAMMER(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLHAMMER_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLHANGINGMAN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLHANGINGMAN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLHANGINGMAN_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLHARAMI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLHARAMI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLHARAMI_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLHARAMICROSS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLHARAMICROSS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLHARAMICROSS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLHIGHWAVE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLHIGHWAVE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLHIGHWAVE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLHIKKAKE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLHIKKAKE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLHIKKAKE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLHIKKAKEMOD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLHIKKAKEMOD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLHIKKAKEMOD_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLHOMINGPIGEON(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLHOMINGPIGEON(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLHOMINGPIGEON_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLIDENTICAL3CROWS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLIDENTICAL3CROWS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLIDENTICAL3CROWS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLINNECK(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLINNECK(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLINNECK_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLINVERTEDHAMMER(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLINVERTEDHAMMER(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLINVERTEDHAMMER_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLKICKING(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLKICKING(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLKICKING_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLKICKINGBYLENGTH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLKICKINGBYLENGTH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLKICKINGBYLENGTH_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLLADDERBOTTOM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLLADDERBOTTOM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLLADDERBOTTOM_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLLONGLEGGEDDOJI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLLONGLEGGEDDOJI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLLONGLEGGEDDOJI_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLLONGLINE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLLONGLINE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLLONGLINE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLMARUBOZU(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLMARUBOZU(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLMARUBOZU_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLMATCHINGLOW(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLMATCHINGLOW(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLMATCHINGLOW_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLMATHOLD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLMATHOLD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLMATHOLD_Lookback(optInPenetration: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLMORNINGDOJISTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLMORNINGDOJISTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLMORNINGDOJISTAR_Lookback(optInPenetration: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLMORNINGSTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLMORNINGSTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLMORNINGSTAR_Lookback(optInPenetration: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLONNECK(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLONNECK(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLONNECK_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLPIERCING(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLPIERCING(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLPIERCING_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLRICKSHAWMAN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLRICKSHAWMAN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLRICKSHAWMAN_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLRISEFALL3METHODS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLRISEFALL3METHODS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLRISEFALL3METHODS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLSEPARATINGLINES(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLSEPARATINGLINES(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLSEPARATINGLINES_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLSHOOTINGSTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLSHOOTINGSTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLSHOOTINGSTAR_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLSHORTLINE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLSHORTLINE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLSHORTLINE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLSPINNINGTOP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLSPINNINGTOP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLSPINNINGTOP_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLSTALLEDPATTERN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLSTALLEDPATTERN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLSTALLEDPATTERN_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLSTICKSANDWICH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLSTICKSANDWICH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLSTICKSANDWICH_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLTAKURI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLTAKURI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLTAKURI_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLTASUKIGAP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLTASUKIGAP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLTASUKIGAP_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLTHRUSTING(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLTHRUSTING(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLTHRUSTING_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLTRISTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLTRISTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLTRISTAR_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLUNIQUE3RIVER(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLUNIQUE3RIVER(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLUNIQUE3RIVER_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLUPSIDEGAP2CROWS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLUPSIDEGAP2CROWS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLUPSIDEGAP2CROWS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLXSIDEGAP3METHODS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLXSIDEGAP3METHODS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLXSIDEGAP3METHODS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CEIL(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CEIL(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CEIL_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CMO(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CMO(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CMO_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CORREL(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CORREL(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CORREL_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_COS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_COS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_COS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_COSH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_COSH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_COSH_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_DEMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_DEMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_DEMA_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_DIV(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_DIV(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_DIV_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_DX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_DX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_DX_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_EMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_EMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_EMA_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_EXP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_EXP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_EXP_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_FLOOR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_FLOOR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_FLOOR_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_HT_DCPERIOD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_HT_DCPERIOD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_HT_DCPERIOD_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_HT_DCPHASE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_HT_DCPHASE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_HT_DCPHASE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_HT_PHASOR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInPhase: *mut f64,
        outQuadrature: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_HT_PHASOR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInPhase: *mut f64,
        outQuadrature: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_HT_PHASOR_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_HT_SINE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outSine: *mut f64,
        outLeadSine: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_HT_SINE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outSine: *mut f64,
        outLeadSine: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_HT_SINE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_HT_TRENDLINE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_HT_TRENDLINE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_HT_TRENDLINE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_HT_TRENDMODE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_HT_TRENDMODE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_HT_TRENDMODE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_IMI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_IMI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_IMI_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_KAMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_KAMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_KAMA_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_LINEARREG(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_LINEARREG(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_LINEARREG_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_LINEARREG_ANGLE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_LINEARREG_ANGLE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_LINEARREG_ANGLE_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_LINEARREG_INTERCEPT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_LINEARREG_INTERCEPT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_LINEARREG_INTERCEPT_Lookback(
        optInTimePeriod: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_LINEARREG_SLOPE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_LINEARREG_SLOPE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_LINEARREG_SLOPE_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_LN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_LN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_LN_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_LOG10(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_LOG10(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_LOG10_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MA_Lookback(
        optInTimePeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MACD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInSignalPeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MACD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInSignalPeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MACD_Lookback(
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInSignalPeriod: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MACDEXT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInFastPeriod: ::core::ffi::c_int,
        optInFastMAType: TA_MAType,
        optInSlowPeriod: ::core::ffi::c_int,
        optInSlowMAType: TA_MAType,
        optInSignalPeriod: ::core::ffi::c_int,
        optInSignalMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MACDEXT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInFastPeriod: ::core::ffi::c_int,
        optInFastMAType: TA_MAType,
        optInSlowPeriod: ::core::ffi::c_int,
        optInSlowMAType: TA_MAType,
        optInSignalPeriod: ::core::ffi::c_int,
        optInSignalMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MACDEXT_Lookback(
        optInFastPeriod: ::core::ffi::c_int,
        optInFastMAType: TA_MAType,
        optInSlowPeriod: ::core::ffi::c_int,
        optInSlowMAType: TA_MAType,
        optInSignalPeriod: ::core::ffi::c_int,
        optInSignalMAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MACDFIX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInSignalPeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MACDFIX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInSignalPeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MACDFIX_Lookback(optInSignalPeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MAMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInFastLimit: f64,
        optInSlowLimit: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMAMA: *mut f64,
        outFAMA: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MAMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInFastLimit: f64,
        optInSlowLimit: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMAMA: *mut f64,
        outFAMA: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MAMA_Lookback(optInFastLimit: f64, optInSlowLimit: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MAVP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        inPeriods: *const f64,
        optInMinPeriod: ::core::ffi::c_int,
        optInMaxPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MAVP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        inPeriods: *const f32,
        optInMinPeriod: ::core::ffi::c_int,
        optInMaxPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MAVP_Lookback(
        optInMinPeriod: ::core::ffi::c_int,
        optInMaxPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MAX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MAX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MAX_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MAXINDEX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MAXINDEX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MAXINDEX_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MEDPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MEDPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MEDPRICE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MFI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        inVolume: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MFI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        inVolume: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MFI_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MIDPOINT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MIDPOINT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MIDPOINT_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MIDPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MIDPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MIDPRICE_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MIN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MIN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MIN_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MININDEX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MININDEX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MININDEX_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MINMAX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMin: *mut f64,
        outMax: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MINMAX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMin: *mut f64,
        outMax: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MINMAX_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MINMAXINDEX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMinIdx: *mut ::core::ffi::c_int,
        outMaxIdx: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MINMAXINDEX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMinIdx: *mut ::core::ffi::c_int,
        outMaxIdx: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MINMAXINDEX_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MINUS_DI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MINUS_DI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MINUS_DI_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MINUS_DM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MINUS_DM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MINUS_DM_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MOM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MOM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MOM_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MULT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MULT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MULT_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_NATR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_NATR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_NATR_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_OBV(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        inVolume: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_OBV(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        inVolume: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_OBV_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_PLUS_DI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_PLUS_DI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_PLUS_DI_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_PLUS_DM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_PLUS_DM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_PLUS_DM_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_PPO(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_PPO(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_PPO_Lookback(
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ROC(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ROC(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ROC_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ROCP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ROCP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ROCP_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ROCR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ROCR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ROCR_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ROCR100(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ROCR100(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ROCR100_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_RSI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_RSI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_RSI_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInAcceleration: f64,
        optInMaximum: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_SAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInAcceleration: f64,
        optInMaximum: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SAR_Lookback(optInAcceleration: f64, optInMaximum: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SAREXT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInStartValue: f64,
        optInOffsetOnReverse: f64,
        optInAccelerationInitLong: f64,
        optInAccelerationLong: f64,
        optInAccelerationMaxLong: f64,
        optInAccelerationInitShort: f64,
        optInAccelerationShort: f64,
        optInAccelerationMaxShort: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_SAREXT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInStartValue: f64,
        optInOffsetOnReverse: f64,
        optInAccelerationInitLong: f64,
        optInAccelerationLong: f64,
        optInAccelerationMaxLong: f64,
        optInAccelerationInitShort: f64,
        optInAccelerationShort: f64,
        optInAccelerationMaxShort: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SAREXT_Lookback(
        optInStartValue: f64,
        optInOffsetOnReverse: f64,
        optInAccelerationInitLong: f64,
        optInAccelerationLong: f64,
        optInAccelerationMaxLong: f64,
        optInAccelerationInitShort: f64,
        optInAccelerationShort: f64,
        optInAccelerationMaxShort: f64,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SIN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_SIN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SIN_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SINH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_SINH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SINH_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_SMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SMA_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SQRT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_SQRT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SQRT_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_STDDEV(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        optInNbDev: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_STDDEV(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        optInNbDev: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_STDDEV_Lookback(
        optInTimePeriod: ::core::ffi::c_int,
        optInNbDev: f64,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_STOCH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInFastK_Period: ::core::ffi::c_int,
        optInSlowK_Period: ::core::ffi::c_int,
        optInSlowK_MAType: TA_MAType,
        optInSlowD_Period: ::core::ffi::c_int,
        optInSlowD_MAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outSlowK: *mut f64,
        outSlowD: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_STOCH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInFastK_Period: ::core::ffi::c_int,
        optInSlowK_Period: ::core::ffi::c_int,
        optInSlowK_MAType: TA_MAType,
        optInSlowD_Period: ::core::ffi::c_int,
        optInSlowD_MAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outSlowK: *mut f64,
        outSlowD: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_STOCH_Lookback(
        optInFastK_Period: ::core::ffi::c_int,
        optInSlowK_Period: ::core::ffi::c_int,
        optInSlowK_MAType: TA_MAType,
        optInSlowD_Period: ::core::ffi::c_int,
        optInSlowD_MAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_STOCHF(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInFastK_Period: ::core::ffi::c_int,
        optInFastD_Period: ::core::ffi::c_int,
        optInFastD_MAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outFastK: *mut f64,
        outFastD: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_STOCHF(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInFastK_Period: ::core::ffi::c_int,
        optInFastD_Period: ::core::ffi::c_int,
        optInFastD_MAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outFastK: *mut f64,
        outFastD: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_STOCHF_Lookback(
        optInFastK_Period: ::core::ffi::c_int,
        optInFastD_Period: ::core::ffi::c_int,
        optInFastD_MAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_STOCHRSI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        optInFastK_Period: ::core::ffi::c_int,
        optInFastD_Period: ::core::ffi::c_int,
        optInFastD_MAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outFastK: *mut f64,
        outFastD: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_STOCHRSI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        optInFastK_Period: ::core::ffi::c_int,
        optInFastD_Period: ::core::ffi::c_int,
        optInFastD_MAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outFastK: *mut f64,
        outFastD: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_STOCHRSI_Lookback(
        optInTimePeriod: ::core::ffi::c_int,
        optInFastK_Period: ::core::ffi::c_int,
        optInFastD_Period: ::core::ffi::c_int,
        optInFastD_MAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SUB(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_SUB(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SUB_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SUM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_SUM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SUM_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_T3(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        optInVFactor: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_T3(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        optInVFactor: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_T3_Lookback(
        optInTimePeriod: ::core::ffi::c_int,
        optInVFactor: f64,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_TAN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_TAN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_TAN_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_TANH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_TANH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_TANH_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_TEMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_TEMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_TEMA_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_TRANGE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_TRANGE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_TRANGE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_TRIMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_TRIMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_TRIMA_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_TRIX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_TRIX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_TRIX_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_TSF(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_TSF(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_TSF_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_TYPPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_TYPPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_TYPPRICE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ULTOSC(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod1: ::core::ffi::c_int,
        optInTimePeriod2: ::core::ffi::c_int,
        optInTimePeriod3: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ULTOSC(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod1: ::core::ffi::c_int,
        optInTimePeriod2: ::core::ffi::c_int,
        optInTimePeriod3: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ULTOSC_Lookback(
        optInTimePeriod1: ::core::ffi::c_int,
        optInTimePeriod2: ::core::ffi::c_int,
        optInTimePeriod3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_VAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        optInNbDev: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_VAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        optInNbDev: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_VAR_Lookback(
        optInTimePeriod: ::core::ffi::c_int,
        optInNbDev: f64,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_WCLPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_WCLPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_WCLPRICE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_WILLR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_WILLR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_WILLR_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_WMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_WMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_WMA_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SetUnstablePeriod(
        id: TA_FuncUnstId,
        unstablePeriod: ::core::ffi::c_uint,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_GetUnstablePeriod(id: TA_FuncUnstId) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn TA_SetCompatibility(value: TA_Compatibility) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_GetCompatibility() -> TA_Compatibility;
}
unsafe extern "C" {
    pub fn TA_SetCandleSettings(
        settingType: TA_CandleSettingType,
        rangeType: TA_RangeType,
        avgPeriod: ::core::ffi::c_int,
        factor: f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_RestoreCandleDefaultSettings(settingType: TA_CandleSettingType) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_GroupTableAlloc(table: *mut *mut TA_StringTable) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_GroupTableFree(table: *mut TA_StringTable) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_FuncTableAlloc(
        group: *const ::core::ffi::c_char,
        table: *mut *mut TA_StringTable,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_FuncTableFree(table: *mut TA_StringTable) -> TA_RetCode;
}
pub type TA_FuncHandle = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn TA_GetFuncHandle(
        name: *const ::core::ffi::c_char,
        handle: *mut *const TA_FuncHandle,
    ) -> TA_RetCode;
}
pub type TA_FuncFlags = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_FuncInfo {
    pub name: *const ::core::ffi::c_char,
    pub group: *const ::core::ffi::c_char,
    pub hint: *const ::core::ffi::c_char,
    pub camelCaseName: *const ::core::ffi::c_char,
    pub flags: TA_FuncFlags,
    pub nbInput: ::core::ffi::c_uint,
    pub nbOptInput: ::core::ffi::c_uint,
    pub nbOutput: ::core::ffi::c_uint,
    pub handle: *const TA_FuncHandle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_FuncInfo"][::core::mem::size_of::<TA_FuncInfo>() - 56usize];
    ["Alignment of TA_FuncInfo"][::core::mem::align_of::<TA_FuncInfo>() - 8usize];
    ["Offset of field: TA_FuncInfo::name"][::core::mem::offset_of!(TA_FuncInfo, name) - 0usize];
    ["Offset of field: TA_FuncInfo::group"][::core::mem::offset_of!(TA_FuncInfo, group) - 8usize];
    ["Offset of field: TA_FuncInfo::hint"][::core::mem::offset_of!(TA_FuncInfo, hint) - 16usize];
    ["Offset of field: TA_FuncInfo::camelCaseName"]
        [::core::mem::offset_of!(TA_FuncInfo, camelCaseName) - 24usize];
    ["Offset of field: TA_FuncInfo::flags"][::core::mem::offset_of!(TA_FuncInfo, flags) - 32usize];
    ["Offset of field: TA_FuncInfo::nbInput"]
        [::core::mem::offset_of!(TA_FuncInfo, nbInput) - 36usize];
    ["Offset of field: TA_FuncInfo::nbOptInput"]
        [::core::mem::offset_of!(TA_FuncInfo, nbOptInput) - 40usize];
    ["Offset of field: TA_FuncInfo::nbOutput"]
        [::core::mem::offset_of!(TA_FuncInfo, nbOutput) - 44usize];
    ["Offset of field: TA_FuncInfo::handle"]
        [::core::mem::offset_of!(TA_FuncInfo, handle) - 48usize];
};
impl Default for TA_FuncInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn TA_GetFuncInfo(
        handle: *const TA_FuncHandle,
        funcInfo: *mut *const TA_FuncInfo,
    ) -> TA_RetCode;
}
pub type TA_CallForEachFunc = ::core::option::Option<
    unsafe extern "C" fn(funcInfo: *const TA_FuncInfo, opaqueData: *mut ::core::ffi::c_void),
>;
unsafe extern "C" {
    pub fn TA_ForEachFunc(
        functionToCall: TA_CallForEachFunc,
        opaqueData: *mut ::core::ffi::c_void,
    ) -> TA_RetCode;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TA_RealRange {
    pub min: TA_Real,
    pub max: TA_Real,
    pub precision: TA_Integer,
    pub suggested_start: TA_Real,
    pub suggested_end: TA_Real,
    pub suggested_increment: TA_Real,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_RealRange"][::core::mem::size_of::<TA_RealRange>() - 48usize];
    ["Alignment of TA_RealRange"][::core::mem::align_of::<TA_RealRange>() - 8usize];
    ["Offset of field: TA_RealRange::min"][::core::mem::offset_of!(TA_RealRange, min) - 0usize];
    ["Offset of field: TA_RealRange::max"][::core::mem::offset_of!(TA_RealRange, max) - 8usize];
    ["Offset of field: TA_RealRange::precision"]
        [::core::mem::offset_of!(TA_RealRange, precision) - 16usize];
    ["Offset of field: TA_RealRange::suggested_start"]
        [::core::mem::offset_of!(TA_RealRange, suggested_start) - 24usize];
    ["Offset of field: TA_RealRange::suggested_end"]
        [::core::mem::offset_of!(TA_RealRange, suggested_end) - 32usize];
    ["Offset of field: TA_RealRange::suggested_increment"]
        [::core::mem::offset_of!(TA_RealRange, suggested_increment) - 40usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TA_IntegerRange {
    pub min: TA_Integer,
    pub max: TA_Integer,
    pub suggested_start: TA_Integer,
    pub suggested_end: TA_Integer,
    pub suggested_increment: TA_Integer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_IntegerRange"][::core::mem::size_of::<TA_IntegerRange>() - 20usize];
    ["Alignment of TA_IntegerRange"][::core::mem::align_of::<TA_IntegerRange>() - 4usize];
    ["Offset of field: TA_IntegerRange::min"]
        [::core::mem::offset_of!(TA_IntegerRange, min) - 0usize];
    ["Offset of field: TA_IntegerRange::max"]
        [::core::mem::offset_of!(TA_IntegerRange, max) - 4usize];
    ["Offset of field: TA_IntegerRange::suggested_start"]
        [::core::mem::offset_of!(TA_IntegerRange, suggested_start) - 8usize];
    ["Offset of field: TA_IntegerRange::suggested_end"]
        [::core::mem::offset_of!(TA_IntegerRange, suggested_end) - 12usize];
    ["Offset of field: TA_IntegerRange::suggested_increment"]
        [::core::mem::offset_of!(TA_IntegerRange, suggested_increment) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_RealDataPair {
    pub value: TA_Real,
    pub string: *const ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_RealDataPair"][::core::mem::size_of::<TA_RealDataPair>() - 16usize];
    ["Alignment of TA_RealDataPair"][::core::mem::align_of::<TA_RealDataPair>() - 8usize];
    ["Offset of field: TA_RealDataPair::value"]
        [::core::mem::offset_of!(TA_RealDataPair, value) - 0usize];
    ["Offset of field: TA_RealDataPair::string"]
        [::core::mem::offset_of!(TA_RealDataPair, string) - 8usize];
};
impl Default for TA_RealDataPair {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_IntegerDataPair {
    pub value: TA_Integer,
    pub string: *const ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_IntegerDataPair"][::core::mem::size_of::<TA_IntegerDataPair>() - 16usize];
    ["Alignment of TA_IntegerDataPair"][::core::mem::align_of::<TA_IntegerDataPair>() - 8usize];
    ["Offset of field: TA_IntegerDataPair::value"]
        [::core::mem::offset_of!(TA_IntegerDataPair, value) - 0usize];
    ["Offset of field: TA_IntegerDataPair::string"]
        [::core::mem::offset_of!(TA_IntegerDataPair, string) - 8usize];
};
impl Default for TA_IntegerDataPair {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_RealList {
    pub data: *const TA_RealDataPair,
    pub nbElement: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_RealList"][::core::mem::size_of::<TA_RealList>() - 16usize];
    ["Alignment of TA_RealList"][::core::mem::align_of::<TA_RealList>() - 8usize];
    ["Offset of field: TA_RealList::data"][::core::mem::offset_of!(TA_RealList, data) - 0usize];
    ["Offset of field: TA_RealList::nbElement"]
        [::core::mem::offset_of!(TA_RealList, nbElement) - 8usize];
};
impl Default for TA_RealList {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_IntegerList {
    pub data: *const TA_IntegerDataPair,
    pub nbElement: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_IntegerList"][::core::mem::size_of::<TA_IntegerList>() - 16usize];
    ["Alignment of TA_IntegerList"][::core::mem::align_of::<TA_IntegerList>() - 8usize];
    ["Offset of field: TA_IntegerList::data"]
        [::core::mem::offset_of!(TA_IntegerList, data) - 0usize];
    ["Offset of field: TA_IntegerList::nbElement"]
        [::core::mem::offset_of!(TA_IntegerList, nbElement) - 8usize];
};
impl Default for TA_IntegerList {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const TA_InputParameterType_TA_Input_Price: TA_InputParameterType = 0;
pub const TA_InputParameterType_TA_Input_Real: TA_InputParameterType = 1;
pub const TA_InputParameterType_TA_Input_Integer: TA_InputParameterType = 2;
pub type TA_InputParameterType = ::core::ffi::c_int;
pub const TA_OptInputParameterType_TA_OptInput_RealRange: TA_OptInputParameterType = 0;
pub const TA_OptInputParameterType_TA_OptInput_RealList: TA_OptInputParameterType = 1;
pub const TA_OptInputParameterType_TA_OptInput_IntegerRange: TA_OptInputParameterType = 2;
pub const TA_OptInputParameterType_TA_OptInput_IntegerList: TA_OptInputParameterType = 3;
pub type TA_OptInputParameterType = ::core::ffi::c_int;
pub const TA_OutputParameterType_TA_Output_Real: TA_OutputParameterType = 0;
pub const TA_OutputParameterType_TA_Output_Integer: TA_OutputParameterType = 1;
pub type TA_OutputParameterType = ::core::ffi::c_int;
pub type TA_InputFlags = ::core::ffi::c_int;
pub type TA_OptInputFlags = ::core::ffi::c_int;
pub type TA_OutputFlags = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_InputParameterInfo {
    pub type_: TA_InputParameterType,
    pub paramName: *const ::core::ffi::c_char,
    pub flags: TA_InputFlags,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_InputParameterInfo"][::core::mem::size_of::<TA_InputParameterInfo>() - 24usize];
    ["Alignment of TA_InputParameterInfo"]
        [::core::mem::align_of::<TA_InputParameterInfo>() - 8usize];
    ["Offset of field: TA_InputParameterInfo::type_"]
        [::core::mem::offset_of!(TA_InputParameterInfo, type_) - 0usize];
    ["Offset of field: TA_InputParameterInfo::paramName"]
        [::core::mem::offset_of!(TA_InputParameterInfo, paramName) - 8usize];
    ["Offset of field: TA_InputParameterInfo::flags"]
        [::core::mem::offset_of!(TA_InputParameterInfo, flags) - 16usize];
};
impl Default for TA_InputParameterInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_OptInputParameterInfo {
    pub type_: TA_OptInputParameterType,
    pub paramName: *const ::core::ffi::c_char,
    pub flags: TA_OptInputFlags,
    pub displayName: *const ::core::ffi::c_char,
    pub dataSet: *const ::core::ffi::c_void,
    pub defaultValue: TA_Real,
    pub hint: *const ::core::ffi::c_char,
    pub helpFile: *const ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_OptInputParameterInfo"]
        [::core::mem::size_of::<TA_OptInputParameterInfo>() - 64usize];
    ["Alignment of TA_OptInputParameterInfo"]
        [::core::mem::align_of::<TA_OptInputParameterInfo>() - 8usize];
    ["Offset of field: TA_OptInputParameterInfo::type_"]
        [::core::mem::offset_of!(TA_OptInputParameterInfo, type_) - 0usize];
    ["Offset of field: TA_OptInputParameterInfo::paramName"]
        [::core::mem::offset_of!(TA_OptInputParameterInfo, paramName) - 8usize];
    ["Offset of field: TA_OptInputParameterInfo::flags"]
        [::core::mem::offset_of!(TA_OptInputParameterInfo, flags) - 16usize];
    ["Offset of field: TA_OptInputParameterInfo::displayName"]
        [::core::mem::offset_of!(TA_OptInputParameterInfo, displayName) - 24usize];
    ["Offset of field: TA_OptInputParameterInfo::dataSet"]
        [::core::mem::offset_of!(TA_OptInputParameterInfo, dataSet) - 32usize];
    ["Offset of field: TA_OptInputParameterInfo::defaultValue"]
        [::core::mem::offset_of!(TA_OptInputParameterInfo, defaultValue) - 40usize];
    ["Offset of field: TA_OptInputParameterInfo::hint"]
        [::core::mem::offset_of!(TA_OptInputParameterInfo, hint) - 48usize];
    ["Offset of field: TA_OptInputParameterInfo::helpFile"]
        [::core::mem::offset_of!(TA_OptInputParameterInfo, helpFile) - 56usize];
};
impl Default for TA_OptInputParameterInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_OutputParameterInfo {
    pub type_: TA_OutputParameterType,
    pub paramName: *const ::core::ffi::c_char,
    pub flags: TA_OutputFlags,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_OutputParameterInfo"][::core::mem::size_of::<TA_OutputParameterInfo>() - 24usize];
    ["Alignment of TA_OutputParameterInfo"]
        [::core::mem::align_of::<TA_OutputParameterInfo>() - 8usize];
    ["Offset of field: TA_OutputParameterInfo::type_"]
        [::core::mem::offset_of!(TA_OutputParameterInfo, type_) - 0usize];
    ["Offset of field: TA_OutputParameterInfo::paramName"]
        [::core::mem::offset_of!(TA_OutputParameterInfo, paramName) - 8usize];
    ["Offset of field: TA_OutputParameterInfo::flags"]
        [::core::mem::offset_of!(TA_OutputParameterInfo, flags) - 16usize];
};
impl Default for TA_OutputParameterInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn TA_GetInputParameterInfo(
        handle: *const TA_FuncHandle,
        paramIndex: ::core::ffi::c_uint,
        info: *mut *const TA_InputParameterInfo,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_GetOptInputParameterInfo(
        handle: *const TA_FuncHandle,
        paramIndex: ::core::ffi::c_uint,
        info: *mut *const TA_OptInputParameterInfo,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_GetOutputParameterInfo(
        handle: *const TA_FuncHandle,
        paramIndex: ::core::ffi::c_uint,
        info: *mut *const TA_OutputParameterInfo,
    ) -> TA_RetCode;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_ParamHolder {
    pub hiddenData: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_ParamHolder"][::core::mem::size_of::<TA_ParamHolder>() - 8usize];
    ["Alignment of TA_ParamHolder"][::core::mem::align_of::<TA_ParamHolder>() - 8usize];
    ["Offset of field: TA_ParamHolder::hiddenData"]
        [::core::mem::offset_of!(TA_ParamHolder, hiddenData) - 0usize];
};
impl Default for TA_ParamHolder {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn TA_ParamHolderAlloc(
        handle: *const TA_FuncHandle,
        allocatedParams: *mut *mut TA_ParamHolder,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ParamHolderFree(params: *mut TA_ParamHolder) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SetInputParamIntegerPtr(
        params: *mut TA_ParamHolder,
        paramIndex: ::core::ffi::c_uint,
        value: *const TA_Integer,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SetInputParamRealPtr(
        params: *mut TA_ParamHolder,
        paramIndex: ::core::ffi::c_uint,
        value: *const TA_Real,
