/* automatically generated by rust-bindgen 0.72.1 */

pub const __has_safe_buffers: u32 = 1;
pub const __DARWIN_ONLY_64_BIT_INO_T: u32 = 0;
pub const __DARWIN_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const __DARWIN_ONLY_VERS_1050: u32 = 0;
pub const __DARWIN_UNIX03: u32 = 1;
pub const __DARWIN_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_VERS_1050: u32 = 1;
pub const __DARWIN_NON_CANCELABLE: u32 = 0;
pub const __DARWIN_SUF_64_BIT_INO_T: &[u8; 9] = b"$INODE64\0";
pub const __DARWIN_SUF_1050: &[u8; 6] = b"$1050\0";
pub const __DARWIN_SUF_EXTSN: &[u8; 14] = b"$DARWIN_EXTSN\0";
pub const __DARWIN_C_ANSI: u32 = 4096;
pub const __DARWIN_C_FULL: u32 = 900000;
pub const __DARWIN_C_LEVEL: u32 = 900000;
pub const __STDC_WANT_LIB_EXT1__: u32 = 1;
pub const __DARWIN_NO_LONG_LONG: u32 = 0;
pub const _DARWIN_FEATURE_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const _DARWIN_FEATURE_UNIX_CONFORMANCE: u32 = 3;
pub const __has_ptrcheck: u32 = 0;
pub const __API_TO_BE_DEPRECATED: u32 = 100000;
pub const __API_TO_BE_DEPRECATED_MACOS: u32 = 100000;
pub const __API_TO_BE_DEPRECATED_IOS: u32 = 100000;
pub const __API_TO_BE_DEPRECATED_MACCATALYST: u32 = 100000;
pub const __API_TO_BE_DEPRECATED_WATCHOS: u32 = 100000;
pub const __API_TO_BE_DEPRECATED_TVOS: u32 = 100000;
pub const __API_TO_BE_DEPRECATED_DRIVERKIT: u32 = 100000;
pub const __API_TO_BE_DEPRECATED_VISIONOS: u32 = 100000;
pub const __MAC_10_0: u32 = 1000;
pub const __MAC_10_1: u32 = 1010;

pub const _POSIX_TTY_NAME_MAX: u32 = 9;
pub const _POSIX2_CHARCLASS_NAME_MAX: u32 = 14;
pub const _POSIX2_COLL_WEIGHTS_MAX: u32 = 2;
pub const _POSIX_RE_DUP_MAX: u32 = 255;
pub const OFF_MIN: i64 = -9223372036854775808;
pub const OFF_MAX: u64 = 9223372036854775807;
pub const PASS_MAX: u32 = 128;
pub const NL_ARGMAX: u32 = 9;
pub const NL_LANGMAX: u32 = 14;
pub const NL_MSGMAX: u32 = 32767;
pub const NL_NMAX: u32 = 1;
pub const NL_SETMAX: u32 = 255;
pub const NL_TEXTMAX: u32 = 2048;
pub const _XOPEN_IOV_MAX: u32 = 16;
pub const IOV_MAX: u32 = 1024;
pub const _XOPEN_NAME_MAX: u32 = 255;
pub const _XOPEN_PATH_MAX: u32 = 1024;
pub const FLT_HAS_SUBNORM: u32 = 1;
pub const DBL_HAS_SUBNORM: u32 = 1;
pub const LDBL_HAS_SUBNORM: u32 = 1;
pub const __64BIT__: u32 = 1;
pub const TA_INTEGER_MIN: i32 = -2147483647;
pub const TA_INTEGER_MAX: u32 = 2147483647;
pub const TA_REAL_MIN: f64 = -30000000000000000000000000000000000000.0;
pub const TA_REAL_MAX: f64 = 30000000000000000000000000000000000000.0;
pub const TA_INTEGER_DEFAULT: i32 = -2147483648;
pub const TA_REAL_DEFAULT: f64 = -40000000000000000000000000000000000000.0;
pub const TA_FUNC_FLG_OVERLAP: u32 = 16777216;
pub const TA_FUNC_FLG_VOLUME: u32 = 67108864;
pub const TA_FUNC_FLG_UNST_PER: u32 = 134217728;
pub const TA_FUNC_FLG_CANDLESTICK: u32 = 268435456;
pub const TA_IN_PRICE_OPEN: u32 = 1;
pub const TA_IN_PRICE_HIGH: u32 = 2;
pub const TA_IN_PRICE_LOW: u32 = 4;
pub const TA_IN_PRICE_CLOSE: u32 = 8;
pub const TA_IN_PRICE_VOLUME: u32 = 16;
pub const TA_IN_PRICE_OPENINTEREST: u32 = 32;
pub const TA_IN_PRICE_TIMESTAMP: u32 = 64;
pub const TA_OPTIN_IS_PERCENT: u32 = 1048576;
pub const TA_OPTIN_IS_DEGREE: u32 = 2097152;
pub const TA_OPTIN_IS_CURRENCY: u32 = 4194304;
pub const TA_OPTIN_ADVANCED: u32 = 16777216;
pub const TA_OUT_LINE: u32 = 1;
pub const TA_OUT_DOT_LINE: u32 = 2;
pub const TA_OUT_DASH_LINE: u32 = 4;
pub const TA_OUT_DOT: u32 = 8;
pub const TA_OUT_HISTO: u32 = 16;
pub const TA_OUT_PATTERN_BOOL: u32 = 32;
pub const TA_OUT_PATTERN_BULL_BEAR: u32 = 64;
pub const TA_OUT_PATTERN_STRENGTH: u32 = 128;
pub const TA_OUT_POSITIVE: u32 = 256;
pub const TA_OUT_NEGATIVE: u32 = 512;
pub const TA_OUT_ZERO: u32 = 1024;
pub const TA_OUT_UPPER_LIMIT: u32 = 2048;
pub const TA_OUT_LOWER_LIMIT: u32 = 4096;
pub type __int8_t = ::core::ffi::c_schar;
pub type __uint8_t = ::core::ffi::c_uchar;
pub type __int16_t = ::core::ffi::c_short;
pub type __uint16_t = ::core::ffi::c_ushort;
pub type __int32_t = ::core::ffi::c_int;
pub type __uint32_t = ::core::ffi::c_uint;
pub type __int64_t = ::core::ffi::c_longlong;
pub type __uint64_t = ::core::ffi::c_ulonglong;
pub type __darwin_intptr_t = ::core::ffi::c_long;
pub type __darwin_natural_t = ::core::ffi::c_uint;
pub type __darwin_ct_rune_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::core::ffi::c_char; 128usize],
    pub _mbstateL: ::core::ffi::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::core::mem::size_of::<__mbstate_t>() - 128usize];
    ["Alignment of __mbstate_t"][::core::mem::align_of::<__mbstate_t>() - 8usize];
    ["Offset of field: __mbstate_t::__mbstate8"][::core::mem::offset_of!(__mbstate_t, __mbstate8) - 0usize];
    ["Offset of field: __mbstate_t::_mbstateL"][::core::mem::offset_of!(__mbstate_t, _mbstateL) - 0usize];
};
impl Default for __mbstate_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::core::ffi::c_long;
pub type __darwin_size_t = ::core::ffi::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::core::ffi::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::core::ffi::c_int;
pub type __darwin_clock_t = ::core::ffi::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::core::ffi::c_long;
pub type __darwin_time_t = ::core::ffi::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::core::ffi::c_uint;
pub type __darwin_fsfilcnt_t = ::core::ffi::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::core::ffi::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::core::ffi::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    pub __arg: *mut ::core::ffi::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_pthread_handler_rec"][::core::mem::size_of::<__darwin_pthread_handler_rec>() - 24usize];
    ["Alignment of __darwin_pthread_handler_rec"][::core::mem::align_of::<__darwin_pthread_handler_rec>() - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__routine"][::core::mem::offset_of!(__darwin_pthread_handler_rec, __routine) - 0usize];
    ["Offset of field: __darwin_pthread_handler_rec::__arg"][::core::mem::offset_of!(__darwin_pthread_handler_rec, __arg) - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__next"][::core::mem::offset_of!(__darwin_pthread_handler_rec, __next) - 16usize];
};
impl Default for __darwin_pthread_handler_rec {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_attr_t"][::core::mem::size_of::<_opaque_pthread_attr_t>() - 64usize];
    ["Alignment of _opaque_pthread_attr_t"][::core::mem::align_of::<_opaque_pthread_attr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_attr_t::__sig"][::core::mem::offset_of!(_opaque_pthread_attr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_attr_t::__opaque"][::core::mem::offset_of!(_opaque_pthread_attr_t, __opaque) - 8usize];
};
impl Default for _opaque_pthread_attr_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_cond_t"][::core::mem::size_of::<_opaque_pthread_cond_t>() - 48usize];
    ["Alignment of _opaque_pthread_cond_t"][::core::mem::align_of::<_opaque_pthread_cond_t>() - 8usize];
    ["Offset of field: _opaque_pthread_cond_t::__sig"][::core::mem::offset_of!(_opaque_pthread_cond_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_cond_t::__opaque"][::core::mem::offset_of!(_opaque_pthread_cond_t, __opaque) - 8usize];
};
impl Default for _opaque_pthread_cond_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_condattr_t"][::core::mem::size_of::<_opaque_pthread_condattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_condattr_t"][::core::mem::align_of::<_opaque_pthread_condattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_condattr_t::__sig"][::core::mem::offset_of!(_opaque_pthread_condattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_condattr_t::__opaque"][::core::mem::offset_of!(_opaque_pthread_condattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutex_t"][::core::mem::size_of::<_opaque_pthread_mutex_t>() - 64usize];
    ["Alignment of _opaque_pthread_mutex_t"][::core::mem::align_of::<_opaque_pthread_mutex_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutex_t::__sig"][::core::mem::offset_of!(_opaque_pthread_mutex_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutex_t::__opaque"][::core::mem::offset_of!(_opaque_pthread_mutex_t, __opaque) - 8usize];
};
impl Default for _opaque_pthread_mutex_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutexattr_t"][::core::mem::size_of::<_opaque_pthread_mutexattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_mutexattr_t"][::core::mem::align_of::<_opaque_pthread_mutexattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__sig"][::core::mem::offset_of!(_opaque_pthread_mutexattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__opaque"][::core::mem::offset_of!(_opaque_pthread_mutexattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_once_t"][::core::mem::size_of::<_opaque_pthread_once_t>() - 16usize];
    ["Alignment of _opaque_pthread_once_t"][::core::mem::align_of::<_opaque_pthread_once_t>() - 8usize];
    ["Offset of field: _opaque_pthread_once_t::__sig"][::core::mem::offset_of!(_opaque_pthread_once_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_once_t::__opaque"][::core::mem::offset_of!(_opaque_pthread_once_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 192usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlock_t"][::core::mem::size_of::<_opaque_pthread_rwlock_t>() - 200usize];
    ["Alignment of _opaque_pthread_rwlock_t"][::core::mem::align_of::<_opaque_pthread_rwlock_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__sig"][::core::mem::offset_of!(_opaque_pthread_rwlock_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__opaque"][::core::mem::offset_of!(_opaque_pthread_rwlock_t, __opaque) - 8usize];
};
impl Default for _opaque_pthread_rwlock_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::core::ffi::c_long,
    pub __opaque: [::core::ffi::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlockattr_t"][::core::mem::size_of::<_opaque_pthread_rwlockattr_t>() - 24usize];
    ["Alignment of _opaque_pthread_rwlockattr_t"][::core::mem::align_of::<_opaque_pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__sig"][::core::mem::offset_of!(_opaque_pthread_rwlockattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__opaque"][::core::mem::offset_of!(_opaque_pthread_rwlockattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::core::ffi::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::core::ffi::c_char; 8176usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_t"][::core::mem::size_of::<_opaque_pthread_t>() - 8192usize];
    ["Alignment of _opaque_pthread_t"][::core::mem::align_of::<_opaque_pthread_t>() - 8usize];
    ["Offset of field: _opaque_pthread_t::__sig"][::core::mem::offset_of!(_opaque_pthread_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_t::__cleanup_stack"][::core::mem::offset_of!(_opaque_pthread_t, __cleanup_stack) - 8usize];
    ["Offset of field: _opaque_pthread_t::__opaque"][::core::mem::offset_of!(_opaque_pthread_t, __opaque) - 16usize];
};
impl Default for _opaque_pthread_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::core::ffi::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type __darwin_nl_item = ::core::ffi::c_int;
pub type __darwin_wctrans_t = ::core::ffi::c_int;
pub type __darwin_wctype_t = __uint32_t;
pub type u_int8_t = ::core::ffi::c_uchar;
pub type u_int16_t = ::core::ffi::c_ushort;
pub type u_int32_t = ::core::ffi::c_uint;
pub type u_int64_t = ::core::ffi::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type va_list = __darwin_va_list;
unsafe extern "C" {
    pub fn renameat(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn renamex_np(arg1: *const ::core::ffi::c_char, arg2: *const ::core::ffi::c_char, arg3: ::core::ffi::c_uint) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn renameatx_np(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: *const ::core::ffi::c_char,
        arg5: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn printf(arg1: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
pub type fpos_t = __darwin_off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::core::ffi::c_uchar,
    pub _size: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::core::mem::size_of::<__sbuf>() - 16usize];
    ["Alignment of __sbuf"][::core::mem::align_of::<__sbuf>() - 8usize];
    ["Offset of field: __sbuf::_base"][::core::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::core::mem::offset_of!(__sbuf, _size) - 8usize];
};
impl Default for __sbuf {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILEX {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::core::ffi::c_uchar,
    pub _r: ::core::ffi::c_int,
    pub _w: ::core::ffi::c_int,
    pub _flags: ::core::ffi::c_short,
    pub _file: ::core::ffi::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::core::ffi::c_int,
    pub _cookie: *mut ::core::ffi::c_void,
    pub _close: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int>,
    pub _read: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: *mut ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub _seek:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void, arg2: fpos_t, arg3: ::core::ffi::c_int) -> fpos_t>,
    pub _write: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub _ub: __sbuf,
    pub _extra: *mut __sFILEX,
    pub _ur: ::core::ffi::c_int,
    pub _ubuf: [::core::ffi::c_uchar; 3usize],
    pub _nbuf: [::core::ffi::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::core::ffi::c_int,
    pub _offset: fpos_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::core::mem::size_of::<__sFILE>() - 152usize];
    ["Alignment of __sFILE"][::core::mem::align_of::<__sFILE>() - 8usize];
    ["Offset of field: __sFILE::_p"][::core::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::core::mem::offset_of!(__sFILE, _r) - 8usize];
    ["Offset of field: __sFILE::_w"][::core::mem::offset_of!(__sFILE, _w) - 12usize];
    ["Offset of field: __sFILE::_flags"][::core::mem::offset_of!(__sFILE, _flags) - 16usize];
    ["Offset of field: __sFILE::_file"][::core::mem::offset_of!(__sFILE, _file) - 18usize];
    ["Offset of field: __sFILE::_bf"][::core::mem::offset_of!(__sFILE, _bf) - 24usize];
    ["Offset of field: __sFILE::_lbfsize"][::core::mem::offset_of!(__sFILE, _lbfsize) - 40usize];
    ["Offset of field: __sFILE::_cookie"][::core::mem::offset_of!(__sFILE, _cookie) - 48usize];
    ["Offset of field: __sFILE::_close"][::core::mem::offset_of!(__sFILE, _close) - 56usize];
    ["Offset of field: __sFILE::_read"][::core::mem::offset_of!(__sFILE, _read) - 64usize];
    ["Offset of field: __sFILE::_seek"][::core::mem::offset_of!(__sFILE, _seek) - 72usize];
    ["Offset of field: __sFILE::_write"][::core::mem::offset_of!(__sFILE, _write) - 80usize];
    ["Offset of field: __sFILE::_ub"][::core::mem::offset_of!(__sFILE, _ub) - 88usize];
    ["Offset of field: __sFILE::_extra"][::core::mem::offset_of!(__sFILE, _extra) - 104usize];
    ["Offset of field: __sFILE::_ur"][::core::mem::offset_of!(__sFILE, _ur) - 112usize];
    ["Offset of field: __sFILE::_ubuf"][::core::mem::offset_of!(__sFILE, _ubuf) - 116usize];
    ["Offset of field: __sFILE::_nbuf"][::core::mem::offset_of!(__sFILE, _nbuf) - 119usize];
    ["Offset of field: __sFILE::_lb"][::core::mem::offset_of!(__sFILE, _lb) - 120usize];
    ["Offset of field: __sFILE::_blksize"][::core::mem::offset_of!(__sFILE, _blksize) - 136usize];
    ["Offset of field: __sFILE::_offset"][::core::mem::offset_of!(__sFILE, _offset) - 144usize];
};
impl Default for __sFILE {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type FILE = __sFILE;
unsafe extern "C" {
    pub static mut __stdinp: *mut FILE;
}
unsafe extern "C" {
    pub static mut __stdoutp: *mut FILE;
}
unsafe extern "C" {
    pub static mut __stderrp: *mut FILE;
}
unsafe extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fgets(arg1: *mut ::core::ffi::c_char, arg2: ::core::ffi::c_int, arg3: *mut FILE) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fopen(__filename: *const ::core::ffi::c_char, __mode: *const ::core::ffi::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fprintf(arg1: *mut FILE, arg2: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fputc(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fputs(arg1: *const ::core::ffi::c_char, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fread(
        __ptr: *mut ::core::ffi::c_void,
        __size: ::core::ffi::c_ulong,
        __nitems: ::core::ffi::c_ulong,
        __stream: *mut FILE,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn freopen(arg1: *const ::core::ffi::c_char, arg2: *const ::core::ffi::c_char, arg3: *mut FILE) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fscanf(arg1: *mut FILE, arg2: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fseek(arg1: *mut FILE, arg2: ::core::ffi::c_long, arg3: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::core::ffi::c_long;
}
unsafe extern "C" {
    pub fn fwrite(
        __ptr: *const ::core::ffi::c_void,
        __size: ::core::ffi::c_ulong,
        __nitems: ::core::ffi::c_ulong,
        __stream: *mut FILE,
    ) -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getchar() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn gets(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn perror(arg1: *const ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn putc(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn putchar(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn puts(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn remove(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn rename(__old: *const ::core::ffi::c_char, __new: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn scanf(arg1: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::core::ffi::c_char);
}
unsafe extern "C" {
    pub fn setvbuf(arg1: *mut FILE, arg2: *mut ::core::ffi::c_char, arg3: ::core::ffi::c_int, arg4: usize) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sprintf(arg1: *mut ::core::ffi::c_char, arg2: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn sscanf(arg1: *const ::core::ffi::c_char, arg2: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
unsafe extern "C" {
    pub fn tmpnam(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn ungetc(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vfprintf(arg1: *mut FILE, arg2: *const ::core::ffi::c_char, arg3: *mut __va_list_tag) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vprintf(arg1: *const ::core::ffi::c_char, arg2: *mut __va_list_tag) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vsprintf(arg1: *mut ::core::ffi::c_char, arg2: *const ::core::ffi::c_char, arg3: *mut __va_list_tag) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ctermid(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fdopen(arg1: ::core::ffi::c_int, arg2: *const ::core::ffi::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn popen(arg1: *const ::core::ffi::c_char, arg2: *const ::core::ffi::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn __srget(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __svfscanf(arg1: *mut FILE, arg2: *const ::core::ffi::c_char, arg3: *mut __va_list_tag) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __swbuf(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
unsafe extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getchar_unlocked() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn putc_unlocked(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn putchar_unlocked(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn putw(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn tempnam(__dir: *const ::core::ffi::c_char, __prefix: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
pub type off_t = __darwin_off_t;
unsafe extern "C" {
    pub fn fseeko(__stream: *mut FILE, __offset: off_t, __whence: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ftello(__stream: *mut FILE) -> off_t;
}
unsafe extern "C" {
    pub fn snprintf(
        __str: *mut ::core::ffi::c_char,
        __size: ::core::ffi::c_ulong,
        __format: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vfscanf(__stream: *mut FILE, __format: *const ::core::ffi::c_char, arg1: *mut __va_list_tag) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vscanf(__format: *const ::core::ffi::c_char, arg1: *mut __va_list_tag) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vsnprintf(
        __str: *mut ::core::ffi::c_char,
        __size: ::core::ffi::c_ulong,
        __format: *const ::core::ffi::c_char,
        arg1: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vsscanf(__str: *const ::core::ffi::c_char, __format: *const ::core::ffi::c_char, arg1: *mut __va_list_tag)
    -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn dprintf(arg1: ::core::ffi::c_int, arg2: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vdprintf(arg1: ::core::ffi::c_int, arg2: *const ::core::ffi::c_char, arg3: *mut __va_list_tag) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn getdelim(
        __linep: *mut *mut ::core::ffi::c_char,
        __linecapp: *mut usize,
        __delimiter: ::core::ffi::c_int,
        __stream: *mut FILE,
    ) -> isize;
}
unsafe extern "C" {
    pub fn getline(__linep: *mut *mut ::core::ffi::c_char, __linecapp: *mut usize, __stream: *mut FILE) -> isize;
}
unsafe extern "C" {
    pub fn fmemopen(__buf: *mut ::core::ffi::c_void, __size: usize, __mode: *const ::core::ffi::c_char) -> *mut FILE;
}
unsafe extern "C" {
    pub fn open_memstream(__bufp: *mut *mut ::core::ffi::c_char, __sizep: *mut usize) -> *mut FILE;
}
unsafe extern "C" {
    pub static sys_nerr: ::core::ffi::c_int;
}
unsafe extern "C" {
    pub static sys_errlist: [*const ::core::ffi::c_char; 0usize];
}
unsafe extern "C" {
    pub fn asprintf(arg1: *mut *mut ::core::ffi::c_char, arg2: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ctermid_r(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fgetln(arg1: *mut FILE, arg2: *mut usize) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fmtcheck(arg1: *const ::core::ffi::c_char, arg2: *const ::core::ffi::c_char) -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn fpurge(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn setbuffer(arg1: *mut FILE, arg2: *mut ::core::ffi::c_char, arg3: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub fn setlinebuf(arg1: *mut FILE) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn vasprintf(arg1: *mut *mut ::core::ffi::c_char, arg2: *const ::core::ffi::c_char, arg3: *mut __va_list_tag)
    -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn funopen(
        arg1: *const ::core::ffi::c_void,
        arg2: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: *mut ::core::ffi::c_char,
                arg3: ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
        arg3: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: *const ::core::ffi::c_char,
                arg3: ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
        arg4: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void, arg2: fpos_t, arg3: ::core::ffi::c_int) -> fpos_t,
        >,
        arg5: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int>,
    ) -> *mut FILE;
}
unsafe extern "C" {
    pub fn __sprintf_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: usize,
        arg4: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __snprintf_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: usize,
        arg3: ::core::ffi::c_int,
        arg4: usize,
        arg5: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __vsprintf_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: usize,
        arg4: *const ::core::ffi::c_char,
        arg5: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn __vsnprintf_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: usize,
        arg3: ::core::ffi::c_int,
        arg4: usize,
        arg5: *const ::core::ffi::c_char,
        arg6: *mut __va_list_tag,
    ) -> ::core::ffi::c_int;
}
pub type Int32 = ::core::ffi::c_int;
pub type UInt32 = ::core::ffi::c_uint;
pub type Int64 = ::core::ffi::c_long;
pub type UInt64 = ::core::ffi::c_ulong;
pub const TA_RetCode_TA_SUCCESS: TA_RetCode = 0;
pub const TA_RetCode_TA_LIB_NOT_INITIALIZE: TA_RetCode = 1;
pub const TA_RetCode_TA_BAD_PARAM: TA_RetCode = 2;
pub const TA_RetCode_TA_ALLOC_ERR: TA_RetCode = 3;
pub const TA_RetCode_TA_GROUP_NOT_FOUND: TA_RetCode = 4;
pub const TA_RetCode_TA_FUNC_NOT_FOUND: TA_RetCode = 5;
pub const TA_RetCode_TA_INVALID_HANDLE: TA_RetCode = 6;
pub const TA_RetCode_TA_INVALID_PARAM_HOLDER: TA_RetCode = 7;
pub const TA_RetCode_TA_INVALID_PARAM_HOLDER_TYPE: TA_RetCode = 8;
pub const TA_RetCode_TA_INVALID_PARAM_FUNCTION: TA_RetCode = 9;
pub const TA_RetCode_TA_INPUT_NOT_ALL_INITIALIZE: TA_RetCode = 10;
pub const TA_RetCode_TA_OUTPUT_NOT_ALL_INITIALIZE: TA_RetCode = 11;
pub const TA_RetCode_TA_OUT_OF_RANGE_START_INDEX: TA_RetCode = 12;
pub const TA_RetCode_TA_OUT_OF_RANGE_END_INDEX: TA_RetCode = 13;
pub const TA_RetCode_TA_INVALID_LIST_TYPE: TA_RetCode = 14;
pub const TA_RetCode_TA_BAD_OBJECT: TA_RetCode = 15;
pub const TA_RetCode_TA_NOT_SUPPORTED: TA_RetCode = 16;
pub const TA_RetCode_TA_INTERNAL_ERROR: TA_RetCode = 5000;
pub const TA_RetCode_TA_UNKNOWN_ERR: TA_RetCode = 65535;
pub type TA_RetCode = ::core::ffi::c_uint;
pub const TA_Compatibility_TA_COMPATIBILITY_DEFAULT: TA_Compatibility = 0;
pub const TA_Compatibility_TA_COMPATIBILITY_METASTOCK: TA_Compatibility = 1;
pub type TA_Compatibility = ::core::ffi::c_uint;
pub const TA_MAType_TA_MAType_SMA: TA_MAType = 0;
pub const TA_MAType_TA_MAType_EMA: TA_MAType = 1;
pub const TA_MAType_TA_MAType_WMA: TA_MAType = 2;
pub const TA_MAType_TA_MAType_DEMA: TA_MAType = 3;
pub const TA_MAType_TA_MAType_TEMA: TA_MAType = 4;
pub const TA_MAType_TA_MAType_TRIMA: TA_MAType = 5;
pub const TA_MAType_TA_MAType_KAMA: TA_MAType = 6;
pub const TA_MAType_TA_MAType_MAMA: TA_MAType = 7;
pub const TA_MAType_TA_MAType_T3: TA_MAType = 8;
pub type TA_MAType = ::core::ffi::c_uint;
pub const TA_FuncUnstId_TA_FUNC_UNST_ADX: TA_FuncUnstId = 0;
pub const TA_FuncUnstId_TA_FUNC_UNST_ADXR: TA_FuncUnstId = 1;
pub const TA_FuncUnstId_TA_FUNC_UNST_ATR: TA_FuncUnstId = 2;
pub const TA_FuncUnstId_TA_FUNC_UNST_CMO: TA_FuncUnstId = 3;
pub const TA_FuncUnstId_TA_FUNC_UNST_DX: TA_FuncUnstId = 4;
pub const TA_FuncUnstId_TA_FUNC_UNST_EMA: TA_FuncUnstId = 5;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_DCPERIOD: TA_FuncUnstId = 6;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_DCPHASE: TA_FuncUnstId = 7;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_PHASOR: TA_FuncUnstId = 8;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_SINE: TA_FuncUnstId = 9;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_TRENDLINE: TA_FuncUnstId = 10;
pub const TA_FuncUnstId_TA_FUNC_UNST_HT_TRENDMODE: TA_FuncUnstId = 11;
pub const TA_FuncUnstId_TA_FUNC_UNST_IMI: TA_FuncUnstId = 12;
pub const TA_FuncUnstId_TA_FUNC_UNST_KAMA: TA_FuncUnstId = 13;
pub const TA_FuncUnstId_TA_FUNC_UNST_MAMA: TA_FuncUnstId = 14;
pub const TA_FuncUnstId_TA_FUNC_UNST_MFI: TA_FuncUnstId = 15;
pub const TA_FuncUnstId_TA_FUNC_UNST_MINUS_DI: TA_FuncUnstId = 16;
pub const TA_FuncUnstId_TA_FUNC_UNST_MINUS_DM: TA_FuncUnstId = 17;
pub const TA_FuncUnstId_TA_FUNC_UNST_NATR: TA_FuncUnstId = 18;
pub const TA_FuncUnstId_TA_FUNC_UNST_PLUS_DI: TA_FuncUnstId = 19;
pub const TA_FuncUnstId_TA_FUNC_UNST_PLUS_DM: TA_FuncUnstId = 20;
pub const TA_FuncUnstId_TA_FUNC_UNST_RSI: TA_FuncUnstId = 21;
pub const TA_FuncUnstId_TA_FUNC_UNST_STOCHRSI: TA_FuncUnstId = 22;
pub const TA_FuncUnstId_TA_FUNC_UNST_T3: TA_FuncUnstId = 23;
pub const TA_FuncUnstId_TA_FUNC_UNST_ALL: TA_FuncUnstId = 24;
pub const TA_FuncUnstId_TA_FUNC_UNST_NONE: TA_FuncUnstId = -1;
pub type TA_FuncUnstId = ::core::ffi::c_int;
pub const TA_RangeType_TA_RangeType_RealBody: TA_RangeType = 0;
pub const TA_RangeType_TA_RangeType_HighLow: TA_RangeType = 1;
pub const TA_RangeType_TA_RangeType_Shadows: TA_RangeType = 2;
pub type TA_RangeType = ::core::ffi::c_uint;
pub const TA_CandleSettingType_TA_BodyLong: TA_CandleSettingType = 0;
pub const TA_CandleSettingType_TA_BodyVeryLong: TA_CandleSettingType = 1;
pub const TA_CandleSettingType_TA_BodyShort: TA_CandleSettingType = 2;
pub const TA_CandleSettingType_TA_BodyDoji: TA_CandleSettingType = 3;
pub const TA_CandleSettingType_TA_ShadowLong: TA_CandleSettingType = 4;
pub const TA_CandleSettingType_TA_ShadowVeryLong: TA_CandleSettingType = 5;
pub const TA_CandleSettingType_TA_ShadowShort: TA_CandleSettingType = 6;
pub const TA_CandleSettingType_TA_ShadowVeryShort: TA_CandleSettingType = 7;
pub const TA_CandleSettingType_TA_Near: TA_CandleSettingType = 8;
pub const TA_CandleSettingType_TA_Far: TA_CandleSettingType = 9;
pub const TA_CandleSettingType_TA_Equal: TA_CandleSettingType = 10;
pub const TA_CandleSettingType_TA_AllCandleSettings: TA_CandleSettingType = 11;
pub type TA_CandleSettingType = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn TA_GetVersionString() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TA_GetVersionMajor() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TA_GetVersionMinor() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TA_GetVersionPatch() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TA_GetVersionDate() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TA_GetVersionTime() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TA_GetVersionBuild() -> *const ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn TA_GetVersionExtra() -> *const ::core::ffi::c_char;
}
pub type TA_Real = f64;
pub type TA_Integer = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_StringTable {
    pub size: ::core::ffi::c_uint,
    pub string: *mut *const ::core::ffi::c_char,
    pub hiddenData: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_StringTable"][::core::mem::size_of::<TA_StringTable>() - 24usize];
    ["Alignment of TA_StringTable"][::core::mem::align_of::<TA_StringTable>() - 8usize];
    ["Offset of field: TA_StringTable::size"][::core::mem::offset_of!(TA_StringTable, size) - 0usize];
    ["Offset of field: TA_StringTable::string"][::core::mem::offset_of!(TA_StringTable, string) - 8usize];
    ["Offset of field: TA_StringTable::hiddenData"][::core::mem::offset_of!(TA_StringTable, hiddenData) - 16usize];
};
impl Default for TA_StringTable {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_RetCodeInfo {
    pub enumStr: *const ::core::ffi::c_char,
    pub infoStr: *const ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_RetCodeInfo"][::core::mem::size_of::<TA_RetCodeInfo>() - 16usize];
    ["Alignment of TA_RetCodeInfo"][::core::mem::align_of::<TA_RetCodeInfo>() - 8usize];
    ["Offset of field: TA_RetCodeInfo::enumStr"][::core::mem::offset_of!(TA_RetCodeInfo, enumStr) - 0usize];
    ["Offset of field: TA_RetCodeInfo::infoStr"][::core::mem::offset_of!(TA_RetCodeInfo, infoStr) - 8usize];
};
impl Default for TA_RetCodeInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn TA_SetRetCodeInfo(theRetCode: TA_RetCode, retCodeInfo: *mut TA_RetCodeInfo);
}
unsafe extern "C" {
    pub fn TA_Initialize() -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_Shutdown() -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ACCBANDS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outRealUpperBand: *mut f64,
        outRealMiddleBand: *mut f64,
        outRealLowerBand: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ACCBANDS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outRealUpperBand: *mut f64,
        outRealMiddleBand: *mut f64,
        outRealLowerBand: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ACCBANDS_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ACOS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ACOS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ACOS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_AD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        inVolume: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_AD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        inVolume: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_AD_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ADD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ADD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ADD_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ADOSC(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        inVolume: *const f64,
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ADOSC(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        inVolume: *const f32,
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ADOSC_Lookback(optInFastPeriod: ::core::ffi::c_int, optInSlowPeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ADX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ADX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ADX_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ADXR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ADXR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ADXR_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_APO(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_APO(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_APO_Lookback(
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_AROON(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outAroonDown: *mut f64,
        outAroonUp: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_AROON(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outAroonDown: *mut f64,
        outAroonUp: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_AROON_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_AROONOSC(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_AROONOSC(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_AROONOSC_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ASIN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ASIN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ASIN_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ATAN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ATAN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ATAN_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ATR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ATR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ATR_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_AVGPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_AVGPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_AVGPRICE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_AVGDEV(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_AVGDEV(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_AVGDEV_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_BBANDS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        optInNbDevUp: f64,
        optInNbDevDn: f64,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outRealUpperBand: *mut f64,
        outRealMiddleBand: *mut f64,
        outRealLowerBand: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_BBANDS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        optInNbDevUp: f64,
        optInNbDevDn: f64,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outRealUpperBand: *mut f64,
        outRealMiddleBand: *mut f64,
        outRealLowerBand: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_BBANDS_Lookback(
        optInTimePeriod: ::core::ffi::c_int,
        optInNbDevUp: f64,
        optInNbDevDn: f64,
        optInMAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_BETA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_BETA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_BETA_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_BOP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_BOP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_BOP_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CCI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CCI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CCI_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDL2CROWS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDL2CROWS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDL2CROWS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDL3BLACKCROWS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDL3BLACKCROWS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDL3BLACKCROWS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDL3INSIDE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDL3INSIDE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDL3INSIDE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDL3LINESTRIKE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDL3LINESTRIKE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDL3LINESTRIKE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDL3OUTSIDE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDL3OUTSIDE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDL3OUTSIDE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDL3STARSINSOUTH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDL3STARSINSOUTH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDL3STARSINSOUTH_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDL3WHITESOLDIERS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDL3WHITESOLDIERS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDL3WHITESOLDIERS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLABANDONEDBABY(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLABANDONEDBABY(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLABANDONEDBABY_Lookback(optInPenetration: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLADVANCEBLOCK(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLADVANCEBLOCK(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLADVANCEBLOCK_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLBELTHOLD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLBELTHOLD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLBELTHOLD_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLBREAKAWAY(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLBREAKAWAY(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLBREAKAWAY_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLCLOSINGMARUBOZU(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLCLOSINGMARUBOZU(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLCLOSINGMARUBOZU_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLCONCEALBABYSWALL(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLCONCEALBABYSWALL(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLCONCEALBABYSWALL_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLCOUNTERATTACK(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLCOUNTERATTACK(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLCOUNTERATTACK_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLDARKCLOUDCOVER(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLDARKCLOUDCOVER(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLDARKCLOUDCOVER_Lookback(optInPenetration: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLDOJI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLDOJI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLDOJI_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLDOJISTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLDOJISTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLDOJISTAR_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLDRAGONFLYDOJI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLDRAGONFLYDOJI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLDRAGONFLYDOJI_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLENGULFING(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLENGULFING(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLENGULFING_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLEVENINGDOJISTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLEVENINGDOJISTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLEVENINGDOJISTAR_Lookback(optInPenetration: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLEVENINGSTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLEVENINGSTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLEVENINGSTAR_Lookback(optInPenetration: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLGAPSIDESIDEWHITE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLGAPSIDESIDEWHITE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLGAPSIDESIDEWHITE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLGRAVESTONEDOJI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLGRAVESTONEDOJI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLGRAVESTONEDOJI_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLHAMMER(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLHAMMER(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLHAMMER_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLHANGINGMAN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLHANGINGMAN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLHANGINGMAN_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLHARAMI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLHARAMI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLHARAMI_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLHARAMICROSS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLHARAMICROSS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLHARAMICROSS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLHIGHWAVE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLHIGHWAVE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLHIGHWAVE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLHIKKAKE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLHIKKAKE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLHIKKAKE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLHIKKAKEMOD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLHIKKAKEMOD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLHIKKAKEMOD_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLHOMINGPIGEON(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLHOMINGPIGEON(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLHOMINGPIGEON_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLIDENTICAL3CROWS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLIDENTICAL3CROWS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLIDENTICAL3CROWS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLINNECK(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLINNECK(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLINNECK_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLINVERTEDHAMMER(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLINVERTEDHAMMER(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLINVERTEDHAMMER_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLKICKING(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLKICKING(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLKICKING_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLKICKINGBYLENGTH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLKICKINGBYLENGTH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLKICKINGBYLENGTH_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLLADDERBOTTOM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLLADDERBOTTOM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLLADDERBOTTOM_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLLONGLEGGEDDOJI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLLONGLEGGEDDOJI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLLONGLEGGEDDOJI_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLLONGLINE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLLONGLINE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLLONGLINE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLMARUBOZU(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLMARUBOZU(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLMARUBOZU_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLMATCHINGLOW(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLMATCHINGLOW(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLMATCHINGLOW_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLMATHOLD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLMATHOLD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLMATHOLD_Lookback(optInPenetration: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLMORNINGDOJISTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLMORNINGDOJISTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLMORNINGDOJISTAR_Lookback(optInPenetration: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLMORNINGSTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLMORNINGSTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInPenetration: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLMORNINGSTAR_Lookback(optInPenetration: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLONNECK(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLONNECK(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLONNECK_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLPIERCING(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLPIERCING(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLPIERCING_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLRICKSHAWMAN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLRICKSHAWMAN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLRICKSHAWMAN_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLRISEFALL3METHODS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLRISEFALL3METHODS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLRISEFALL3METHODS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLSEPARATINGLINES(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLSEPARATINGLINES(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLSEPARATINGLINES_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLSHOOTINGSTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLSHOOTINGSTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLSHOOTINGSTAR_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLSHORTLINE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLSHORTLINE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLSHORTLINE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLSPINNINGTOP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLSPINNINGTOP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLSPINNINGTOP_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLSTALLEDPATTERN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLSTALLEDPATTERN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLSTALLEDPATTERN_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLSTICKSANDWICH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLSTICKSANDWICH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLSTICKSANDWICH_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLTAKURI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLTAKURI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLTAKURI_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLTASUKIGAP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLTASUKIGAP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLTASUKIGAP_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLTHRUSTING(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLTHRUSTING(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLTHRUSTING_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLTRISTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLTRISTAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLTRISTAR_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLUNIQUE3RIVER(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLUNIQUE3RIVER(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLUNIQUE3RIVER_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLUPSIDEGAP2CROWS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLUPSIDEGAP2CROWS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLUPSIDEGAP2CROWS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CDLXSIDEGAP3METHODS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CDLXSIDEGAP3METHODS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CDLXSIDEGAP3METHODS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CEIL(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CEIL(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CEIL_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CMO(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CMO(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CMO_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_CORREL(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_CORREL(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CORREL_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_COS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_COS(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_COS_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_COSH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_COSH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_COSH_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_DEMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_DEMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_DEMA_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_DIV(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_DIV(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_DIV_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_DX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_DX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_DX_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_EMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_EMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_EMA_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_EXP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_EXP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_EXP_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_FLOOR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_FLOOR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_FLOOR_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_HT_DCPERIOD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_HT_DCPERIOD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_HT_DCPERIOD_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_HT_DCPHASE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_HT_DCPHASE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_HT_DCPHASE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_HT_PHASOR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInPhase: *mut f64,
        outQuadrature: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_HT_PHASOR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInPhase: *mut f64,
        outQuadrature: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_HT_PHASOR_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_HT_SINE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outSine: *mut f64,
        outLeadSine: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_HT_SINE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outSine: *mut f64,
        outLeadSine: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_HT_SINE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_HT_TRENDLINE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_HT_TRENDLINE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_HT_TRENDLINE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_HT_TRENDMODE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_HT_TRENDMODE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_HT_TRENDMODE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_IMI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_IMI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inOpen: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_IMI_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_KAMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_KAMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_KAMA_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_LINEARREG(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_LINEARREG(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_LINEARREG_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_LINEARREG_ANGLE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_LINEARREG_ANGLE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_LINEARREG_ANGLE_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_LINEARREG_INTERCEPT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_LINEARREG_INTERCEPT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_LINEARREG_INTERCEPT_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_LINEARREG_SLOPE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_LINEARREG_SLOPE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_LINEARREG_SLOPE_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_LN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_LN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_LN_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_LOG10(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_LOG10(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_LOG10_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MA_Lookback(optInTimePeriod: ::core::ffi::c_int, optInMAType: TA_MAType) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MACD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInSignalPeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MACD(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInSignalPeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MACD_Lookback(
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInSignalPeriod: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MACDEXT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInFastPeriod: ::core::ffi::c_int,
        optInFastMAType: TA_MAType,
        optInSlowPeriod: ::core::ffi::c_int,
        optInSlowMAType: TA_MAType,
        optInSignalPeriod: ::core::ffi::c_int,
        optInSignalMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MACDEXT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInFastPeriod: ::core::ffi::c_int,
        optInFastMAType: TA_MAType,
        optInSlowPeriod: ::core::ffi::c_int,
        optInSlowMAType: TA_MAType,
        optInSignalPeriod: ::core::ffi::c_int,
        optInSignalMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MACDEXT_Lookback(
        optInFastPeriod: ::core::ffi::c_int,
        optInFastMAType: TA_MAType,
        optInSlowPeriod: ::core::ffi::c_int,
        optInSlowMAType: TA_MAType,
        optInSignalPeriod: ::core::ffi::c_int,
        optInSignalMAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MACDFIX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInSignalPeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MACDFIX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInSignalPeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMACD: *mut f64,
        outMACDSignal: *mut f64,
        outMACDHist: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MACDFIX_Lookback(optInSignalPeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MAMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInFastLimit: f64,
        optInSlowLimit: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMAMA: *mut f64,
        outFAMA: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MAMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInFastLimit: f64,
        optInSlowLimit: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMAMA: *mut f64,
        outFAMA: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MAMA_Lookback(optInFastLimit: f64, optInSlowLimit: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MAVP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        inPeriods: *const f64,
        optInMinPeriod: ::core::ffi::c_int,
        optInMaxPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MAVP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        inPeriods: *const f32,
        optInMinPeriod: ::core::ffi::c_int,
        optInMaxPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MAVP_Lookback(
        optInMinPeriod: ::core::ffi::c_int,
        optInMaxPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MAX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MAX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MAX_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MAXINDEX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MAXINDEX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MAXINDEX_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MEDPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MEDPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MEDPRICE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MFI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        inVolume: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MFI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        inVolume: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MFI_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MIDPOINT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MIDPOINT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MIDPOINT_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MIDPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MIDPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MIDPRICE_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MIN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MIN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MIN_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MININDEX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MININDEX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outInteger: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MININDEX_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MINMAX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMin: *mut f64,
        outMax: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MINMAX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMin: *mut f64,
        outMax: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MINMAX_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MINMAXINDEX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMinIdx: *mut ::core::ffi::c_int,
        outMaxIdx: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MINMAXINDEX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outMinIdx: *mut ::core::ffi::c_int,
        outMaxIdx: *mut ::core::ffi::c_int,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MINMAXINDEX_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MINUS_DI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MINUS_DI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MINUS_DI_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MINUS_DM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MINUS_DM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MINUS_DM_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MOM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MOM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MOM_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_MULT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_MULT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_MULT_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_NATR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_NATR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_NATR_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_OBV(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        inVolume: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_OBV(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        inVolume: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_OBV_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_PLUS_DI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_PLUS_DI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_PLUS_DI_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_PLUS_DM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_PLUS_DM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_PLUS_DM_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_PPO(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_PPO(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_PPO_Lookback(
        optInFastPeriod: ::core::ffi::c_int,
        optInSlowPeriod: ::core::ffi::c_int,
        optInMAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ROC(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ROC(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ROC_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ROCP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ROCP(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ROCP_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ROCR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ROCR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ROCR_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ROCR100(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ROCR100(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ROCR100_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_RSI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_RSI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_RSI_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInAcceleration: f64,
        optInMaximum: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_SAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInAcceleration: f64,
        optInMaximum: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SAR_Lookback(optInAcceleration: f64, optInMaximum: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SAREXT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        optInStartValue: f64,
        optInOffsetOnReverse: f64,
        optInAccelerationInitLong: f64,
        optInAccelerationLong: f64,
        optInAccelerationMaxLong: f64,
        optInAccelerationInitShort: f64,
        optInAccelerationShort: f64,
        optInAccelerationMaxShort: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_SAREXT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        optInStartValue: f64,
        optInOffsetOnReverse: f64,
        optInAccelerationInitLong: f64,
        optInAccelerationLong: f64,
        optInAccelerationMaxLong: f64,
        optInAccelerationInitShort: f64,
        optInAccelerationShort: f64,
        optInAccelerationMaxShort: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SAREXT_Lookback(
        optInStartValue: f64,
        optInOffsetOnReverse: f64,
        optInAccelerationInitLong: f64,
        optInAccelerationLong: f64,
        optInAccelerationMaxLong: f64,
        optInAccelerationInitShort: f64,
        optInAccelerationShort: f64,
        optInAccelerationMaxShort: f64,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SIN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_SIN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SIN_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SINH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_SINH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SINH_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_SMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SMA_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SQRT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_SQRT(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SQRT_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_STDDEV(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        optInNbDev: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_STDDEV(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        optInNbDev: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_STDDEV_Lookback(optInTimePeriod: ::core::ffi::c_int, optInNbDev: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_STOCH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInFastK_Period: ::core::ffi::c_int,
        optInSlowK_Period: ::core::ffi::c_int,
        optInSlowK_MAType: TA_MAType,
        optInSlowD_Period: ::core::ffi::c_int,
        optInSlowD_MAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outSlowK: *mut f64,
        outSlowD: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_STOCH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInFastK_Period: ::core::ffi::c_int,
        optInSlowK_Period: ::core::ffi::c_int,
        optInSlowK_MAType: TA_MAType,
        optInSlowD_Period: ::core::ffi::c_int,
        optInSlowD_MAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outSlowK: *mut f64,
        outSlowD: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_STOCH_Lookback(
        optInFastK_Period: ::core::ffi::c_int,
        optInSlowK_Period: ::core::ffi::c_int,
        optInSlowK_MAType: TA_MAType,
        optInSlowD_Period: ::core::ffi::c_int,
        optInSlowD_MAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_STOCHF(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInFastK_Period: ::core::ffi::c_int,
        optInFastD_Period: ::core::ffi::c_int,
        optInFastD_MAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outFastK: *mut f64,
        outFastD: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_STOCHF(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInFastK_Period: ::core::ffi::c_int,
        optInFastD_Period: ::core::ffi::c_int,
        optInFastD_MAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outFastK: *mut f64,
        outFastD: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_STOCHF_Lookback(
        optInFastK_Period: ::core::ffi::c_int,
        optInFastD_Period: ::core::ffi::c_int,
        optInFastD_MAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_STOCHRSI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        optInFastK_Period: ::core::ffi::c_int,
        optInFastD_Period: ::core::ffi::c_int,
        optInFastD_MAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outFastK: *mut f64,
        outFastD: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_STOCHRSI(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        optInFastK_Period: ::core::ffi::c_int,
        optInFastD_Period: ::core::ffi::c_int,
        optInFastD_MAType: TA_MAType,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outFastK: *mut f64,
        outFastD: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_STOCHRSI_Lookback(
        optInTimePeriod: ::core::ffi::c_int,
        optInFastK_Period: ::core::ffi::c_int,
        optInFastD_Period: ::core::ffi::c_int,
        optInFastD_MAType: TA_MAType,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SUB(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f64,
        inReal1: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_SUB(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal0: *const f32,
        inReal1: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SUB_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SUM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_SUM(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SUM_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_T3(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        optInVFactor: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_T3(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        optInVFactor: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_T3_Lookback(optInTimePeriod: ::core::ffi::c_int, optInVFactor: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_TAN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_TAN(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_TAN_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_TANH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_TANH(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_TANH_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_TEMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_TEMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_TEMA_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_TRANGE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_TRANGE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_TRANGE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_TRIMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_TRIMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_TRIMA_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_TRIX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_TRIX(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_TRIX_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_TSF(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_TSF(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_TSF_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_TYPPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_TYPPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_TYPPRICE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_ULTOSC(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod1: ::core::ffi::c_int,
        optInTimePeriod2: ::core::ffi::c_int,
        optInTimePeriod3: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_ULTOSC(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod1: ::core::ffi::c_int,
        optInTimePeriod2: ::core::ffi::c_int,
        optInTimePeriod3: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ULTOSC_Lookback(
        optInTimePeriod1: ::core::ffi::c_int,
        optInTimePeriod2: ::core::ffi::c_int,
        optInTimePeriod3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_VAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        optInNbDev: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_VAR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        optInNbDev: f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_VAR_Lookback(optInTimePeriod: ::core::ffi::c_int, optInNbDev: f64) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_WCLPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_WCLPRICE(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_WCLPRICE_Lookback() -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_WILLR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f64,
        inLow: *const f64,
        inClose: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_WILLR(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inHigh: *const f32,
        inLow: *const f32,
        inClose: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_WILLR_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_WMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f64,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_S_WMA(
        startIdx: ::core::ffi::c_int,
        endIdx: ::core::ffi::c_int,
        inReal: *const f32,
        optInTimePeriod: ::core::ffi::c_int,
        outBegIdx: *mut ::core::ffi::c_int,
        outNBElement: *mut ::core::ffi::c_int,
        outReal: *mut f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_WMA_Lookback(optInTimePeriod: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn TA_SetUnstablePeriod(id: TA_FuncUnstId, unstablePeriod: ::core::ffi::c_uint) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_GetUnstablePeriod(id: TA_FuncUnstId) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn TA_SetCompatibility(value: TA_Compatibility) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_GetCompatibility() -> TA_Compatibility;
}
unsafe extern "C" {
    pub fn TA_SetCandleSettings(
        settingType: TA_CandleSettingType,
        rangeType: TA_RangeType,
        avgPeriod: ::core::ffi::c_int,
        factor: f64,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_RestoreCandleDefaultSettings(settingType: TA_CandleSettingType) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_GroupTableAlloc(table: *mut *mut TA_StringTable) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_GroupTableFree(table: *mut TA_StringTable) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_FuncTableAlloc(group: *const ::core::ffi::c_char, table: *mut *mut TA_StringTable) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_FuncTableFree(table: *mut TA_StringTable) -> TA_RetCode;
}
pub type TA_FuncHandle = ::core::ffi::c_uint;
unsafe extern "C" {
    pub fn TA_GetFuncHandle(name: *const ::core::ffi::c_char, handle: *mut *const TA_FuncHandle) -> TA_RetCode;
}
pub type TA_FuncFlags = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_FuncInfo {
    pub name: *const ::core::ffi::c_char,
    pub group: *const ::core::ffi::c_char,
    pub hint: *const ::core::ffi::c_char,
    pub camelCaseName: *const ::core::ffi::c_char,
    pub flags: TA_FuncFlags,
    pub nbInput: ::core::ffi::c_uint,
    pub nbOptInput: ::core::ffi::c_uint,
    pub nbOutput: ::core::ffi::c_uint,
    pub handle: *const TA_FuncHandle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_FuncInfo"][::core::mem::size_of::<TA_FuncInfo>() - 56usize];
    ["Alignment of TA_FuncInfo"][::core::mem::align_of::<TA_FuncInfo>() - 8usize];
    ["Offset of field: TA_FuncInfo::name"][::core::mem::offset_of!(TA_FuncInfo, name) - 0usize];
    ["Offset of field: TA_FuncInfo::group"][::core::mem::offset_of!(TA_FuncInfo, group) - 8usize];
    ["Offset of field: TA_FuncInfo::hint"][::core::mem::offset_of!(TA_FuncInfo, hint) - 16usize];
    ["Offset of field: TA_FuncInfo::camelCaseName"][::core::mem::offset_of!(TA_FuncInfo, camelCaseName) - 24usize];
    ["Offset of field: TA_FuncInfo::flags"][::core::mem::offset_of!(TA_FuncInfo, flags) - 32usize];
    ["Offset of field: TA_FuncInfo::nbInput"][::core::mem::offset_of!(TA_FuncInfo, nbInput) - 36usize];
    ["Offset of field: TA_FuncInfo::nbOptInput"][::core::mem::offset_of!(TA_FuncInfo, nbOptInput) - 40usize];
    ["Offset of field: TA_FuncInfo::nbOutput"][::core::mem::offset_of!(TA_FuncInfo, nbOutput) - 44usize];
    ["Offset of field: TA_FuncInfo::handle"][::core::mem::offset_of!(TA_FuncInfo, handle) - 48usize];
};
impl Default for TA_FuncInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn TA_GetFuncInfo(handle: *const TA_FuncHandle, funcInfo: *mut *const TA_FuncInfo) -> TA_RetCode;
}
pub type TA_CallForEachFunc =
    ::core::option::Option<unsafe extern "C" fn(funcInfo: *const TA_FuncInfo, opaqueData: *mut ::core::ffi::c_void)>;
unsafe extern "C" {
    pub fn TA_ForEachFunc(functionToCall: TA_CallForEachFunc, opaqueData: *mut ::core::ffi::c_void) -> TA_RetCode;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TA_RealRange {
    pub min: TA_Real,
    pub max: TA_Real,
    pub precision: TA_Integer,
    pub suggested_start: TA_Real,
    pub suggested_end: TA_Real,
    pub suggested_increment: TA_Real,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_RealRange"][::core::mem::size_of::<TA_RealRange>() - 48usize];
    ["Alignment of TA_RealRange"][::core::mem::align_of::<TA_RealRange>() - 8usize];
    ["Offset of field: TA_RealRange::min"][::core::mem::offset_of!(TA_RealRange, min) - 0usize];
    ["Offset of field: TA_RealRange::max"][::core::mem::offset_of!(TA_RealRange, max) - 8usize];
    ["Offset of field: TA_RealRange::precision"][::core::mem::offset_of!(TA_RealRange, precision) - 16usize];
    ["Offset of field: TA_RealRange::suggested_start"][::core::mem::offset_of!(TA_RealRange, suggested_start) - 24usize];
    ["Offset of field: TA_RealRange::suggested_end"][::core::mem::offset_of!(TA_RealRange, suggested_end) - 32usize];
    ["Offset of field: TA_RealRange::suggested_increment"][::core::mem::offset_of!(TA_RealRange, suggested_increment) - 40usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct TA_IntegerRange {
    pub min: TA_Integer,
    pub max: TA_Integer,
    pub suggested_start: TA_Integer,
    pub suggested_end: TA_Integer,
    pub suggested_increment: TA_Integer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_IntegerRange"][::core::mem::size_of::<TA_IntegerRange>() - 20usize];
    ["Alignment of TA_IntegerRange"][::core::mem::align_of::<TA_IntegerRange>() - 4usize];
    ["Offset of field: TA_IntegerRange::min"][::core::mem::offset_of!(TA_IntegerRange, min) - 0usize];
    ["Offset of field: TA_IntegerRange::max"][::core::mem::offset_of!(TA_IntegerRange, max) - 4usize];
    ["Offset of field: TA_IntegerRange::suggested_start"][::core::mem::offset_of!(TA_IntegerRange, suggested_start) - 8usize];
    ["Offset of field: TA_IntegerRange::suggested_end"][::core::mem::offset_of!(TA_IntegerRange, suggested_end) - 12usize];
    ["Offset of field: TA_IntegerRange::suggested_increment"][::core::mem::offset_of!(TA_IntegerRange, suggested_increment) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_RealDataPair {
    pub value: TA_Real,
    pub string: *const ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_RealDataPair"][::core::mem::size_of::<TA_RealDataPair>() - 16usize];
    ["Alignment of TA_RealDataPair"][::core::mem::align_of::<TA_RealDataPair>() - 8usize];
    ["Offset of field: TA_RealDataPair::value"][::core::mem::offset_of!(TA_RealDataPair, value) - 0usize];
    ["Offset of field: TA_RealDataPair::string"][::core::mem::offset_of!(TA_RealDataPair, string) - 8usize];
};
impl Default for TA_RealDataPair {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_IntegerDataPair {
    pub value: TA_Integer,
    pub string: *const ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_IntegerDataPair"][::core::mem::size_of::<TA_IntegerDataPair>() - 16usize];
    ["Alignment of TA_IntegerDataPair"][::core::mem::align_of::<TA_IntegerDataPair>() - 8usize];
    ["Offset of field: TA_IntegerDataPair::value"][::core::mem::offset_of!(TA_IntegerDataPair, value) - 0usize];
    ["Offset of field: TA_IntegerDataPair::string"][::core::mem::offset_of!(TA_IntegerDataPair, string) - 8usize];
};
impl Default for TA_IntegerDataPair {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_RealList {
    pub data: *const TA_RealDataPair,
    pub nbElement: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_RealList"][::core::mem::size_of::<TA_RealList>() - 16usize];
    ["Alignment of TA_RealList"][::core::mem::align_of::<TA_RealList>() - 8usize];
    ["Offset of field: TA_RealList::data"][::core::mem::offset_of!(TA_RealList, data) - 0usize];
    ["Offset of field: TA_RealList::nbElement"][::core::mem::offset_of!(TA_RealList, nbElement) - 8usize];
};
impl Default for TA_RealList {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_IntegerList {
    pub data: *const TA_IntegerDataPair,
    pub nbElement: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_IntegerList"][::core::mem::size_of::<TA_IntegerList>() - 16usize];
    ["Alignment of TA_IntegerList"][::core::mem::align_of::<TA_IntegerList>() - 8usize];
    ["Offset of field: TA_IntegerList::data"][::core::mem::offset_of!(TA_IntegerList, data) - 0usize];
    ["Offset of field: TA_IntegerList::nbElement"][::core::mem::offset_of!(TA_IntegerList, nbElement) - 8usize];
};
impl Default for TA_IntegerList {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const TA_InputParameterType_TA_Input_Price: TA_InputParameterType = 0;
pub const TA_InputParameterType_TA_Input_Real: TA_InputParameterType = 1;
pub const TA_InputParameterType_TA_Input_Integer: TA_InputParameterType = 2;
pub type TA_InputParameterType = ::core::ffi::c_uint;
pub const TA_OptInputParameterType_TA_OptInput_RealRange: TA_OptInputParameterType = 0;
pub const TA_OptInputParameterType_TA_OptInput_RealList: TA_OptInputParameterType = 1;
pub const TA_OptInputParameterType_TA_OptInput_IntegerRange: TA_OptInputParameterType = 2;
pub const TA_OptInputParameterType_TA_OptInput_IntegerList: TA_OptInputParameterType = 3;
pub type TA_OptInputParameterType = ::core::ffi::c_uint;
pub const TA_OutputParameterType_TA_Output_Real: TA_OutputParameterType = 0;
pub const TA_OutputParameterType_TA_Output_Integer: TA_OutputParameterType = 1;
pub type TA_OutputParameterType = ::core::ffi::c_uint;
pub type TA_InputFlags = ::core::ffi::c_int;
pub type TA_OptInputFlags = ::core::ffi::c_int;
pub type TA_OutputFlags = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_InputParameterInfo {
    pub type_: TA_InputParameterType,
    pub paramName: *const ::core::ffi::c_char,
    pub flags: TA_InputFlags,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_InputParameterInfo"][::core::mem::size_of::<TA_InputParameterInfo>() - 24usize];
    ["Alignment of TA_InputParameterInfo"][::core::mem::align_of::<TA_InputParameterInfo>() - 8usize];
    ["Offset of field: TA_InputParameterInfo::type_"][::core::mem::offset_of!(TA_InputParameterInfo, type_) - 0usize];
    ["Offset of field: TA_InputParameterInfo::paramName"][::core::mem::offset_of!(TA_InputParameterInfo, paramName) - 8usize];
    ["Offset of field: TA_InputParameterInfo::flags"][::core::mem::offset_of!(TA_InputParameterInfo, flags) - 16usize];
};
impl Default for TA_InputParameterInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_OptInputParameterInfo {
    pub type_: TA_OptInputParameterType,
    pub paramName: *const ::core::ffi::c_char,
    pub flags: TA_OptInputFlags,
    pub displayName: *const ::core::ffi::c_char,
    pub dataSet: *const ::core::ffi::c_void,
    pub defaultValue: TA_Real,
    pub hint: *const ::core::ffi::c_char,
    pub helpFile: *const ::core::ffi::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_OptInputParameterInfo"][::core::mem::size_of::<TA_OptInputParameterInfo>() - 64usize];
    ["Alignment of TA_OptInputParameterInfo"][::core::mem::align_of::<TA_OptInputParameterInfo>() - 8usize];
    ["Offset of field: TA_OptInputParameterInfo::type_"][::core::mem::offset_of!(TA_OptInputParameterInfo, type_) - 0usize];
    ["Offset of field: TA_OptInputParameterInfo::paramName"][::core::mem::offset_of!(TA_OptInputParameterInfo, paramName) - 8usize];
    ["Offset of field: TA_OptInputParameterInfo::flags"][::core::mem::offset_of!(TA_OptInputParameterInfo, flags) - 16usize];
    ["Offset of field: TA_OptInputParameterInfo::displayName"][::core::mem::offset_of!(TA_OptInputParameterInfo, displayName) - 24usize];
    ["Offset of field: TA_OptInputParameterInfo::dataSet"][::core::mem::offset_of!(TA_OptInputParameterInfo, dataSet) - 32usize];
    ["Offset of field: TA_OptInputParameterInfo::defaultValue"][::core::mem::offset_of!(TA_OptInputParameterInfo, defaultValue) - 40usize];
    ["Offset of field: TA_OptInputParameterInfo::hint"][::core::mem::offset_of!(TA_OptInputParameterInfo, hint) - 48usize];
    ["Offset of field: TA_OptInputParameterInfo::helpFile"][::core::mem::offset_of!(TA_OptInputParameterInfo, helpFile) - 56usize];
};
impl Default for TA_OptInputParameterInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_OutputParameterInfo {
    pub type_: TA_OutputParameterType,
    pub paramName: *const ::core::ffi::c_char,
    pub flags: TA_OutputFlags,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_OutputParameterInfo"][::core::mem::size_of::<TA_OutputParameterInfo>() - 24usize];
    ["Alignment of TA_OutputParameterInfo"][::core::mem::align_of::<TA_OutputParameterInfo>() - 8usize];
    ["Offset of field: TA_OutputParameterInfo::type_"][::core::mem::offset_of!(TA_OutputParameterInfo, type_) - 0usize];
    ["Offset of field: TA_OutputParameterInfo::paramName"][::core::mem::offset_of!(TA_OutputParameterInfo, paramName) - 8usize];
    ["Offset of field: TA_OutputParameterInfo::flags"][::core::mem::offset_of!(TA_OutputParameterInfo, flags) - 16usize];
};
impl Default for TA_OutputParameterInfo {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn TA_GetInputParameterInfo(
        handle: *const TA_FuncHandle,
        paramIndex: ::core::ffi::c_uint,
        info: *mut *const TA_InputParameterInfo,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_GetOptInputParameterInfo(
        handle: *const TA_FuncHandle,
        paramIndex: ::core::ffi::c_uint,
        info: *mut *const TA_OptInputParameterInfo,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_GetOutputParameterInfo(
        handle: *const TA_FuncHandle,
        paramIndex: ::core::ffi::c_uint,
        info: *mut *const TA_OutputParameterInfo,
    ) -> TA_RetCode;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TA_ParamHolder {
    pub hiddenData: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TA_ParamHolder"][::core::mem::size_of::<TA_ParamHolder>() - 8usize];
    ["Alignment of TA_ParamHolder"][::core::mem::align_of::<TA_ParamHolder>() - 8usize];
    ["Offset of field: TA_ParamHolder::hiddenData"][::core::mem::offset_of!(TA_ParamHolder, hiddenData) - 0usize];
};
impl Default for TA_ParamHolder {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn TA_ParamHolderAlloc(handle: *const TA_FuncHandle, allocatedParams: *mut *mut TA_ParamHolder) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_ParamHolderFree(params: *mut TA_ParamHolder) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SetInputParamIntegerPtr(params: *mut TA_ParamHolder, paramIndex: ::core::ffi::c_uint, value: *const TA_Integer)
    -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SetInputParamRealPtr(params: *mut TA_ParamHolder, paramIndex: ::core::ffi::c_uint, value: *const TA_Real) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SetInputParamPricePtr(
        params: *mut TA_ParamHolder,
        paramIndex: ::core::ffi::c_uint,
        open: *const TA_Real,
        high: *const TA_Real,
        low: *const TA_Real,
        close: *const TA_Real,
        volume: *const TA_Real,
        openInterest: *const TA_Real,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SetOptInputParamInteger(params: *mut TA_ParamHolder, paramIndex: ::core::ffi::c_uint, optInValue: TA_Integer) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SetOptInputParamReal(params: *mut TA_ParamHolder, paramIndex: ::core::ffi::c_uint, optInValue: TA_Real) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SetOutputParamIntegerPtr(params: *mut TA_ParamHolder, paramIndex: ::core::ffi::c_uint, out: *mut TA_Integer) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_SetOutputParamRealPtr(params: *mut TA_ParamHolder, paramIndex: ::core::ffi::c_uint, out: *mut TA_Real) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_GetLookback(params: *const TA_ParamHolder, lookback: *mut TA_Integer) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_CallFunc(
        params: *const TA_ParamHolder,
        startIdx: TA_Integer,
        endIdx: TA_Integer,
        outBegIdx: *mut TA_Integer,
        outNbElement: *mut TA_Integer,
    ) -> TA_RetCode;
}
unsafe extern "C" {
    pub fn TA_FunctionDescriptionXML() -> *const ::core::ffi::c_char;
}
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::core::ffi::c_uint,
    pub fp_offset: ::core::ffi::c_uint,
    pub overflow_arg_area: *mut ::core::ffi::c_void,
    pub reg_save_area: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __va_list_tag"][::core::mem::size_of::<__va_list_tag>() - 24usize];
    ["Alignment of __va_list_tag"][::core::mem::align_of::<__va_list_tag>() - 8usize];
    ["Offset of field: __va_list_tag::gp_offset"][::core::mem::offset_of!(__va_list_tag, gp_offset) - 0usize];
    ["Offset of field: __va_list_tag::fp_offset"][::core::mem::offset_of!(__va_list_tag, fp_offset) - 4usize];
    ["Offset of field: __va_list_tag::overflow_arg_area"][::core::mem::offset_of!(__va_list_tag, overflow_arg_area) - 8usize];
    ["Offset of field: __va_list_tag::reg_save_area"][::core::mem::offset_of!(__va_list_tag, reg_save_area) - 16usize];
};
impl Default for __va_list_tag {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
